Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x8ed (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x1a9b8): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x7d41b): ../Core/Src/CLCD_I2C.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x125aa): C:/Users/tanla/STM32CubeIDE/workspace_1.15.1/TKHTN/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 4 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x42eae): signed char
 <1><31>: Abbrev Number: 3 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x26f9d): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 4 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1af4b): unsigned char
 <1><44>: Abbrev Number: 4 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x63a9f): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x6d592): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 4 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x2b9b0): short unsigned int
 <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xb9ac): long int
 <1><65>: Abbrev Number: 3 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x5501d): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 4 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x1f388): long unsigned int
 <1><78>: Abbrev Number: 4 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x3d3c0): long long int
 <1><7f>: Abbrev Number: 4 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1b7b6): long long unsigned int
 <1><86>: Abbrev Number: 19 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 4 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xb339): unsigned int
 <1><94>: Abbrev Number: 3 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x26f9f): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x8b3b6): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x8b384): uint32_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 48
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x65>
 <1><bd>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c3>   DW_AT_byte_size   : 16
    <c4>   DW_AT_decl_file   : 4
    <c4>   DW_AT_decl_line   : 290
    <c6>   DW_AT_decl_column : 9
    <c6>   DW_AT_sibling     : <0xfb>
 <2><ca>: Abbrev Number: 9 (DW_TAG_member)
    <cb>   DW_AT_name        : CCR
    <cf>   DW_AT_decl_file   : 4
    <cf>   DW_AT_decl_line   : 292
    <d1>   DW_AT_decl_column : 17
    <d1>   DW_AT_type        : <0xbd>
    <d5>   DW_AT_data_member_location: 0
 <2><d6>: Abbrev Number: 10 (DW_TAG_member)
    <d7>   DW_AT_name        : (indirect string, offset: 0x337f3): CNDTR
    <db>   DW_AT_decl_file   : 4
    <db>   DW_AT_decl_line   : 293
    <dd>   DW_AT_decl_column : 17
    <dd>   DW_AT_type        : <0xbd>
    <e1>   DW_AT_data_member_location: 4
 <2><e2>: Abbrev Number: 10 (DW_TAG_member)
    <e3>   DW_AT_name        : (indirect string, offset: 0x800ee): CPAR
    <e7>   DW_AT_decl_file   : 4
    <e7>   DW_AT_decl_line   : 294
    <e9>   DW_AT_decl_column : 17
    <e9>   DW_AT_type        : <0xbd>
    <ed>   DW_AT_data_member_location: 8
 <2><ee>: Abbrev Number: 10 (DW_TAG_member)
    <ef>   DW_AT_name        : (indirect string, offset: 0x49b1c): CMAR
    <f3>   DW_AT_decl_file   : 4
    <f3>   DW_AT_decl_line   : 295
    <f5>   DW_AT_decl_column : 17
    <f5>   DW_AT_type        : <0xbd>
    <f9>   DW_AT_data_member_location: 12
 <2><fa>: Abbrev Number: 0
 <1><fb>: Abbrev Number: 17 (DW_TAG_typedef)
    <fc>   DW_AT_name        : (indirect string, offset: 0x6cd98): DMA_Channel_TypeDef
    <100>   DW_AT_decl_file   : 4
    <100>   DW_AT_decl_line   : 296
    <102>   DW_AT_decl_column : 3
    <102>   DW_AT_type        : <0xc2>
 <1><106>: Abbrev Number: 16 (DW_TAG_structure_type)
    <107>   DW_AT_byte_size   : 8
    <108>   DW_AT_decl_file   : 4
    <108>   DW_AT_decl_line   : 298
    <10a>   DW_AT_decl_column : 9
    <10a>   DW_AT_sibling     : <0x127>
 <2><10e>: Abbrev Number: 9 (DW_TAG_member)
    <10f>   DW_AT_name        : ISR
    <113>   DW_AT_decl_file   : 4
    <113>   DW_AT_decl_line   : 300
    <115>   DW_AT_decl_column : 17
    <115>   DW_AT_type        : <0xbd>
    <119>   DW_AT_data_member_location: 0
 <2><11a>: Abbrev Number: 10 (DW_TAG_member)
    <11b>   DW_AT_name        : (indirect string, offset: 0x5db71): IFCR
    <11f>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 301
    <121>   DW_AT_decl_column : 17
    <121>   DW_AT_type        : <0xbd>
    <125>   DW_AT_data_member_location: 4
 <2><126>: Abbrev Number: 0
 <1><127>: Abbrev Number: 17 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0x3075e): DMA_TypeDef
    <12c>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 302
    <12e>   DW_AT_decl_column : 3
    <12e>   DW_AT_type        : <0x106>
 <1><132>: Abbrev Number: 16 (DW_TAG_structure_type)
    <133>   DW_AT_byte_size   : 36
    <134>   DW_AT_decl_file   : 4
    <134>   DW_AT_decl_line   : 384
    <136>   DW_AT_decl_column : 9
    <136>   DW_AT_sibling     : <0x1a6>
 <2><13a>: Abbrev Number: 9 (DW_TAG_member)
    <13b>   DW_AT_name        : CR1
    <13f>   DW_AT_decl_file   : 4
    <13f>   DW_AT_decl_line   : 386
    <141>   DW_AT_decl_column : 17
    <141>   DW_AT_type        : <0xbd>
    <145>   DW_AT_data_member_location: 0
 <2><146>: Abbrev Number: 9 (DW_TAG_member)
    <147>   DW_AT_name        : CR2
    <14b>   DW_AT_decl_file   : 4
    <14b>   DW_AT_decl_line   : 387
    <14d>   DW_AT_decl_column : 17
    <14d>   DW_AT_type        : <0xbd>
    <151>   DW_AT_data_member_location: 4
 <2><152>: Abbrev Number: 10 (DW_TAG_member)
    <153>   DW_AT_name        : (indirect string, offset: 0x260eb): OAR1
    <157>   DW_AT_decl_file   : 4
    <157>   DW_AT_decl_line   : 388
    <159>   DW_AT_decl_column : 17
    <159>   DW_AT_type        : <0xbd>
    <15d>   DW_AT_data_member_location: 8
 <2><15e>: Abbrev Number: 10 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x260f0): OAR2
    <163>   DW_AT_decl_file   : 4
    <163>   DW_AT_decl_line   : 389
    <165>   DW_AT_decl_column : 17
    <165>   DW_AT_type        : <0xbd>
    <169>   DW_AT_data_member_location: 12
 <2><16a>: Abbrev Number: 9 (DW_TAG_member)
    <16b>   DW_AT_name        : DR
    <16e>   DW_AT_decl_file   : 4
    <16e>   DW_AT_decl_line   : 390
    <170>   DW_AT_decl_column : 17
    <170>   DW_AT_type        : <0xbd>
    <174>   DW_AT_data_member_location: 16
 <2><175>: Abbrev Number: 9 (DW_TAG_member)
    <176>   DW_AT_name        : SR1
    <17a>   DW_AT_decl_file   : 4
    <17a>   DW_AT_decl_line   : 391
    <17c>   DW_AT_decl_column : 17
    <17c>   DW_AT_type        : <0xbd>
    <180>   DW_AT_data_member_location: 20
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : SR2
    <186>   DW_AT_decl_file   : 4
    <186>   DW_AT_decl_line   : 392
    <188>   DW_AT_decl_column : 17
    <188>   DW_AT_type        : <0xbd>
    <18c>   DW_AT_data_member_location: 24
 <2><18d>: Abbrev Number: 9 (DW_TAG_member)
    <18e>   DW_AT_name        : CCR
    <192>   DW_AT_decl_file   : 4
    <192>   DW_AT_decl_line   : 393
    <194>   DW_AT_decl_column : 17
    <194>   DW_AT_type        : <0xbd>
    <198>   DW_AT_data_member_location: 28
 <2><199>: Abbrev Number: 10 (DW_TAG_member)
    <19a>   DW_AT_name        : (indirect string, offset: 0x44995): TRISE
    <19e>   DW_AT_decl_file   : 4
    <19e>   DW_AT_decl_line   : 394
    <1a0>   DW_AT_decl_column : 17
    <1a0>   DW_AT_type        : <0xbd>
    <1a4>   DW_AT_data_member_location: 32
 <2><1a5>: Abbrev Number: 0
 <1><1a6>: Abbrev Number: 17 (DW_TAG_typedef)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x6965d): I2C_TypeDef
    <1ab>   DW_AT_decl_file   : 4
    <1ab>   DW_AT_decl_line   : 395
    <1ad>   DW_AT_decl_column : 3
    <1ad>   DW_AT_type        : <0x132>
 <1><1b1>: Abbrev Number: 4 (DW_TAG_base_type)
    <1b2>   DW_AT_byte_size   : 8
    <1b3>   DW_AT_encoding    : 4	(float)
    <1b4>   DW_AT_name        : (indirect string, offset: 0x886e0): long double
 <1><1b8>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <1b9>   DW_AT_encoding    : 7	(unsigned)
    <1b9>   DW_AT_byte_size   : 1
    <1b9>   DW_AT_type        : <0x3d>
    <1bd>   DW_AT_decl_file   : 5
    <1be>   DW_AT_decl_line   : 39
    <1bf>   DW_AT_decl_column : 1
    <1bf>   DW_AT_sibling     : <0x1dc>
 <2><1c3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x2d04e): HAL_OK
    <1c8>   DW_AT_const_value : 0
 <2><1c9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x53893): HAL_ERROR
    <1ce>   DW_AT_const_value : 1
 <2><1cf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x1733d): HAL_BUSY
    <1d4>   DW_AT_const_value : 2
 <2><1d5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x2741c): HAL_TIMEOUT
    <1da>   DW_AT_const_value : 3
 <2><1db>: Abbrev Number: 0
 <1><1dc>: Abbrev Number: 3 (DW_TAG_typedef)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x18fe): HAL_StatusTypeDef
    <1e1>   DW_AT_decl_file   : 5
    <1e2>   DW_AT_decl_line   : 44
    <1e3>   DW_AT_decl_column : 3
    <1e4>   DW_AT_type        : <0x1b8>
 <1><1e8>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <1e9>   DW_AT_encoding    : 7	(unsigned)
    <1e9>   DW_AT_byte_size   : 1
    <1e9>   DW_AT_type        : <0x3d>
    <1ed>   DW_AT_decl_file   : 5
    <1ee>   DW_AT_decl_line   : 50
    <1ef>   DW_AT_decl_column : 1
    <1ef>   DW_AT_sibling     : <0x200>
 <2><1f3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x62d6e): HAL_UNLOCKED
    <1f8>   DW_AT_const_value : 0
 <2><1f9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x84885): HAL_LOCKED
    <1fe>   DW_AT_const_value : 1
 <2><1ff>: Abbrev Number: 0
 <1><200>: Abbrev Number: 3 (DW_TAG_typedef)
    <201>   DW_AT_name        : (indirect string, offset: 0x4e83a): HAL_LockTypeDef
    <205>   DW_AT_decl_file   : 5
    <206>   DW_AT_decl_line   : 53
    <207>   DW_AT_decl_column : 3
    <208>   DW_AT_type        : <0x1e8>
 <1><20c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <20d>   DW_AT_byte_size   : 28
    <20e>   DW_AT_decl_file   : 6
    <20f>   DW_AT_decl_line   : 47
    <210>   DW_AT_decl_column : 9
    <210>   DW_AT_sibling     : <0x270>
 <2><214>: Abbrev Number: 1 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x90c37): Direction
    <219>   DW_AT_decl_file   : 6
    <21a>   DW_AT_decl_line   : 49
    <21b>   DW_AT_decl_column : 12
    <21c>   DW_AT_type        : <0xb1>
    <220>   DW_AT_data_member_location: 0
 <2><221>: Abbrev Number: 1 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x90ce): PeriphInc
    <226>   DW_AT_decl_file   : 6
    <227>   DW_AT_decl_line   : 53
    <228>   DW_AT_decl_column : 12
    <229>   DW_AT_type        : <0xb1>
    <22d>   DW_AT_data_member_location: 4
 <2><22e>: Abbrev Number: 1 (DW_TAG_member)
    <22f>   DW_AT_name        : (indirect string, offset: 0x14dc7): MemInc
    <233>   DW_AT_decl_file   : 6
    <234>   DW_AT_decl_line   : 56
    <235>   DW_AT_decl_column : 12
    <236>   DW_AT_type        : <0xb1>
    <23a>   DW_AT_data_member_location: 8
 <2><23b>: Abbrev Number: 1 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x4278b): PeriphDataAlignment
    <240>   DW_AT_decl_file   : 6
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 12
    <243>   DW_AT_type        : <0xb1>
    <247>   DW_AT_data_member_location: 12
 <2><248>: Abbrev Number: 1 (DW_TAG_member)
    <249>   DW_AT_name        : (indirect string, offset: 0x785b1): MemDataAlignment
    <24d>   DW_AT_decl_file   : 6
    <24e>   DW_AT_decl_line   : 62
    <24f>   DW_AT_decl_column : 12
    <250>   DW_AT_type        : <0xb1>
    <254>   DW_AT_data_member_location: 16
 <2><255>: Abbrev Number: 1 (DW_TAG_member)
    <256>   DW_AT_name        : (indirect string, offset: 0x917e8): Mode
    <25a>   DW_AT_decl_file   : 6
    <25b>   DW_AT_decl_line   : 65
    <25c>   DW_AT_decl_column : 12
    <25d>   DW_AT_type        : <0xb1>
    <261>   DW_AT_data_member_location: 20
 <2><262>: Abbrev Number: 1 (DW_TAG_member)
    <263>   DW_AT_name        : (indirect string, offset: 0x90082): Priority
    <267>   DW_AT_decl_file   : 6
    <268>   DW_AT_decl_line   : 70
    <269>   DW_AT_decl_column : 12
    <26a>   DW_AT_type        : <0xb1>
    <26e>   DW_AT_data_member_location: 24
 <2><26f>: Abbrev Number: 0
 <1><270>: Abbrev Number: 3 (DW_TAG_typedef)
    <271>   DW_AT_name        : (indirect string, offset: 0x23998): DMA_InitTypeDef
    <275>   DW_AT_decl_file   : 6
    <276>   DW_AT_decl_line   : 72
    <277>   DW_AT_decl_column : 3
    <278>   DW_AT_type        : <0x20c>
 <1><27c>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <27d>   DW_AT_encoding    : 7	(unsigned)
    <27d>   DW_AT_byte_size   : 1
    <27d>   DW_AT_type        : <0x3d>
    <281>   DW_AT_decl_file   : 6
    <282>   DW_AT_decl_line   : 78
    <283>   DW_AT_decl_column : 1
    <283>   DW_AT_sibling     : <0x2a0>
 <2><287>: Abbrev Number: 2 (DW_TAG_enumerator)
    <288>   DW_AT_name        : (indirect string, offset: 0x63d59): HAL_DMA_STATE_RESET
    <28c>   DW_AT_const_value : 0
 <2><28d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <28e>   DW_AT_name        : (indirect string, offset: 0x246ac): HAL_DMA_STATE_READY
    <292>   DW_AT_const_value : 1
 <2><293>: Abbrev Number: 2 (DW_TAG_enumerator)
    <294>   DW_AT_name        : (indirect string, offset: 0x5ccf0): HAL_DMA_STATE_BUSY
    <298>   DW_AT_const_value : 2
 <2><299>: Abbrev Number: 2 (DW_TAG_enumerator)
    <29a>   DW_AT_name        : (indirect string, offset: 0x82626): HAL_DMA_STATE_TIMEOUT
    <29e>   DW_AT_const_value : 3
 <2><29f>: Abbrev Number: 0
 <1><2a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x49905): HAL_DMA_StateTypeDef
    <2a5>   DW_AT_decl_file   : 6
    <2a6>   DW_AT_decl_line   : 83
    <2a7>   DW_AT_decl_column : 2
    <2a8>   DW_AT_type        : <0x27c>
 <1><2ac>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <2ad>   DW_AT_type        : <0x2a0>
 <1><2b1>: Abbrev Number: 20 (DW_TAG_structure_type)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x71d36): __DMA_HandleTypeDef
    <2b6>   DW_AT_byte_size   : 68
    <2b7>   DW_AT_decl_file   : 6
    <2b8>   DW_AT_decl_line   : 110
    <2b9>   DW_AT_decl_column : 16
    <2ba>   DW_AT_sibling     : <0x35b>
 <2><2be>: Abbrev Number: 1 (DW_TAG_member)
    <2bf>   DW_AT_name        : (indirect string, offset: 0x33e9b): Instance
    <2c3>   DW_AT_decl_file   : 6
    <2c4>   DW_AT_decl_line   : 112
    <2c5>   DW_AT_decl_column : 31
    <2c6>   DW_AT_type        : <0x35b>
    <2ca>   DW_AT_data_member_location: 0
 <2><2cb>: Abbrev Number: 1 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x8587f): Init
    <2d0>   DW_AT_decl_file   : 6
    <2d1>   DW_AT_decl_line   : 114
    <2d2>   DW_AT_decl_column : 30
    <2d3>   DW_AT_type        : <0x270>
    <2d7>   DW_AT_data_member_location: 4
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x5f61c): Lock
    <2dd>   DW_AT_decl_file   : 6
    <2de>   DW_AT_decl_line   : 116
    <2df>   DW_AT_decl_column : 30
    <2e0>   DW_AT_type        : <0x200>
    <2e4>   DW_AT_data_member_location: 32
 <2><2e5>: Abbrev Number: 1 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x8ad0f): State
    <2ea>   DW_AT_decl_file   : 6
    <2eb>   DW_AT_decl_line   : 118
    <2ec>   DW_AT_decl_column : 30
    <2ed>   DW_AT_type        : <0x2ac>
    <2f1>   DW_AT_data_member_location: 33
 <2><2f2>: Abbrev Number: 1 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x7e3b8): Parent
    <2f7>   DW_AT_decl_file   : 6
    <2f8>   DW_AT_decl_line   : 120
    <2f9>   DW_AT_decl_column : 31
    <2fa>   DW_AT_type        : <0x360>
    <2fe>   DW_AT_data_member_location: 36
 <2><2ff>: Abbrev Number: 1 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x83eee): XferCpltCallback
    <304>   DW_AT_decl_file   : 6
    <305>   DW_AT_decl_line   : 122
    <306>   DW_AT_decl_column : 33
    <307>   DW_AT_type        : <0x372>
    <30b>   DW_AT_data_member_location: 40
 <2><30c>: Abbrev Number: 1 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x67f9a): XferHalfCpltCallback
    <311>   DW_AT_decl_file   : 6
    <312>   DW_AT_decl_line   : 124
    <313>   DW_AT_decl_column : 33
    <314>   DW_AT_type        : <0x372>
    <318>   DW_AT_data_member_location: 44
 <2><319>: Abbrev Number: 1 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x13168): XferErrorCallback
    <31e>   DW_AT_decl_file   : 6
    <31f>   DW_AT_decl_line   : 126
    <320>   DW_AT_decl_column : 33
    <321>   DW_AT_type        : <0x372>
    <325>   DW_AT_data_member_location: 48
 <2><326>: Abbrev Number: 1 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x7bfa0): XferAbortCallback
    <32b>   DW_AT_decl_file   : 6
    <32c>   DW_AT_decl_line   : 128
    <32d>   DW_AT_decl_column : 33
    <32e>   DW_AT_type        : <0x372>
    <332>   DW_AT_data_member_location: 52
 <2><333>: Abbrev Number: 1 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x819d9): ErrorCode
    <338>   DW_AT_decl_file   : 6
    <339>   DW_AT_decl_line   : 130
    <33a>   DW_AT_decl_column : 30
    <33b>   DW_AT_type        : <0xbd>
    <33f>   DW_AT_data_member_location: 56
 <2><340>: Abbrev Number: 1 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x392d7): DmaBaseAddress
    <345>   DW_AT_decl_file   : 6
    <346>   DW_AT_decl_line   : 132
    <347>   DW_AT_decl_column : 31
    <348>   DW_AT_type        : <0x377>
    <34c>   DW_AT_data_member_location: 60
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x1b59b): ChannelIndex
    <352>   DW_AT_decl_file   : 6
    <353>   DW_AT_decl_line   : 134
    <354>   DW_AT_decl_column : 30
    <355>   DW_AT_type        : <0xb1>
    <359>   DW_AT_data_member_location: 64
 <2><35a>: Abbrev Number: 0
 <1><35b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <35c>   DW_AT_byte_size   : 4
    <35c>   DW_AT_type        : <0xfb>
 <1><360>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <361>   DW_AT_byte_size   : 4
 <1><362>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <363>   DW_AT_prototyped  : 1
    <363>   DW_AT_sibling     : <0x36d>
 <2><367>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <368>   DW_AT_type        : <0x36d>
 <2><36c>: Abbrev Number: 0
 <1><36d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <36e>   DW_AT_byte_size   : 4
    <36e>   DW_AT_type        : <0x2b1>
 <1><372>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <373>   DW_AT_byte_size   : 4
    <373>   DW_AT_type        : <0x362>
 <1><377>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <378>   DW_AT_byte_size   : 4
    <378>   DW_AT_type        : <0x127>
 <1><37c>: Abbrev Number: 3 (DW_TAG_typedef)
    <37d>   DW_AT_name        : (indirect string, offset: 0x71d38): DMA_HandleTypeDef
    <381>   DW_AT_decl_file   : 6
    <382>   DW_AT_decl_line   : 136
    <383>   DW_AT_decl_column : 3
    <384>   DW_AT_type        : <0x2b1>
 <1><388>: Abbrev Number: 14 (DW_TAG_structure_type)
    <389>   DW_AT_byte_size   : 32
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 47
    <38c>   DW_AT_decl_column : 9
    <38c>   DW_AT_sibling     : <0x3f9>
 <2><390>: Abbrev Number: 1 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0x7d354): ClockSpeed
    <395>   DW_AT_decl_file   : 7
    <396>   DW_AT_decl_line   : 49
    <397>   DW_AT_decl_column : 12
    <398>   DW_AT_type        : <0xb1>
    <39c>   DW_AT_data_member_location: 0
 <2><39d>: Abbrev Number: 1 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x510ad): DutyCycle
    <3a2>   DW_AT_decl_file   : 7
    <3a3>   DW_AT_decl_line   : 52
    <3a4>   DW_AT_decl_column : 12
    <3a5>   DW_AT_type        : <0xb1>
    <3a9>   DW_AT_data_member_location: 4
 <2><3aa>: Abbrev Number: 1 (DW_TAG_member)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x300db): OwnAddress1
    <3af>   DW_AT_decl_file   : 7
    <3b0>   DW_AT_decl_line   : 55
    <3b1>   DW_AT_decl_column : 12
    <3b2>   DW_AT_type        : <0xb1>
    <3b6>   DW_AT_data_member_location: 8
 <2><3b7>: Abbrev Number: 1 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x391ef): AddressingMode
    <3bc>   DW_AT_decl_file   : 7
    <3bd>   DW_AT_decl_line   : 58
    <3be>   DW_AT_decl_column : 12
    <3bf>   DW_AT_type        : <0xb1>
    <3c3>   DW_AT_data_member_location: 12
 <2><3c4>: Abbrev Number: 1 (DW_TAG_member)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x60351): DualAddressMode
    <3c9>   DW_AT_decl_file   : 7
    <3ca>   DW_AT_decl_line   : 61
    <3cb>   DW_AT_decl_column : 12
    <3cc>   DW_AT_type        : <0xb1>
    <3d0>   DW_AT_data_member_location: 16
 <2><3d1>: Abbrev Number: 1 (DW_TAG_member)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x300e7): OwnAddress2
    <3d6>   DW_AT_decl_file   : 7
    <3d7>   DW_AT_decl_line   : 64
    <3d8>   DW_AT_decl_column : 12
    <3d9>   DW_AT_type        : <0xb1>
    <3dd>   DW_AT_data_member_location: 20
 <2><3de>: Abbrev Number: 1 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0x15a96): GeneralCallMode
    <3e3>   DW_AT_decl_file   : 7
    <3e4>   DW_AT_decl_line   : 67
    <3e5>   DW_AT_decl_column : 12
    <3e6>   DW_AT_type        : <0xb1>
    <3ea>   DW_AT_data_member_location: 24
 <2><3eb>: Abbrev Number: 1 (DW_TAG_member)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x29255): NoStretchMode
    <3f0>   DW_AT_decl_file   : 7
    <3f1>   DW_AT_decl_line   : 70
    <3f2>   DW_AT_decl_column : 12
    <3f3>   DW_AT_type        : <0xb1>
    <3f7>   DW_AT_data_member_location: 28
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 3 (DW_TAG_typedef)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x2a780): I2C_InitTypeDef
    <3fe>   DW_AT_decl_file   : 7
    <3ff>   DW_AT_decl_line   : 73
    <400>   DW_AT_decl_column : 3
    <401>   DW_AT_type        : <0x388>
 <1><405>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <406>   DW_AT_encoding    : 7	(unsigned)
    <406>   DW_AT_byte_size   : 1
    <406>   DW_AT_type        : <0x3d>
    <40a>   DW_AT_decl_file   : 7
    <40b>   DW_AT_decl_line   : 107
    <40c>   DW_AT_decl_column : 1
    <40c>   DW_AT_sibling     : <0x453>
 <2><410>: Abbrev Number: 2 (DW_TAG_enumerator)
    <411>   DW_AT_name        : (indirect string, offset: 0x743b): HAL_I2C_STATE_RESET
    <415>   DW_AT_const_value : 0
 <2><416>: Abbrev Number: 2 (DW_TAG_enumerator)
    <417>   DW_AT_name        : (indirect string, offset: 0x2b2e6): HAL_I2C_STATE_READY
    <41b>   DW_AT_const_value : 32
 <2><41c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <41d>   DW_AT_name        : (indirect string, offset: 0xea26): HAL_I2C_STATE_BUSY
    <421>   DW_AT_const_value : 36
 <2><422>: Abbrev Number: 2 (DW_TAG_enumerator)
    <423>   DW_AT_name        : (indirect string, offset: 0x604bc): HAL_I2C_STATE_BUSY_TX
    <427>   DW_AT_const_value : 33
 <2><428>: Abbrev Number: 2 (DW_TAG_enumerator)
    <429>   DW_AT_name        : (indirect string, offset: 0x2ea1c): HAL_I2C_STATE_BUSY_RX
    <42d>   DW_AT_const_value : 34
 <2><42e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <42f>   DW_AT_name        : (indirect string, offset: 0x34bf4): HAL_I2C_STATE_LISTEN
    <433>   DW_AT_const_value : 40
 <2><434>: Abbrev Number: 2 (DW_TAG_enumerator)
    <435>   DW_AT_name        : (indirect string, offset: 0x1fdbb): HAL_I2C_STATE_BUSY_TX_LISTEN
    <439>   DW_AT_const_value : 41
 <2><43a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <43b>   DW_AT_name        : (indirect string, offset: 0x616fa): HAL_I2C_STATE_BUSY_RX_LISTEN
    <43f>   DW_AT_const_value : 42
 <2><440>: Abbrev Number: 2 (DW_TAG_enumerator)
    <441>   DW_AT_name        : (indirect string, offset: 0x3291f): HAL_I2C_STATE_ABORT
    <445>   DW_AT_const_value : 96
 <2><446>: Abbrev Number: 2 (DW_TAG_enumerator)
    <447>   DW_AT_name        : (indirect string, offset: 0x6fbbc): HAL_I2C_STATE_TIMEOUT
    <44b>   DW_AT_const_value : 160
 <2><44c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <44d>   DW_AT_name        : (indirect string, offset: 0x78acd): HAL_I2C_STATE_ERROR
    <451>   DW_AT_const_value : 224
 <2><452>: Abbrev Number: 0
 <1><453>: Abbrev Number: 3 (DW_TAG_typedef)
    <454>   DW_AT_name        : (indirect string, offset: 0x16589): HAL_I2C_StateTypeDef
    <458>   DW_AT_decl_file   : 7
    <459>   DW_AT_decl_line   : 122
    <45a>   DW_AT_decl_column : 3
    <45b>   DW_AT_type        : <0x405>
 <1><45f>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <460>   DW_AT_type        : <0x453>
 <1><464>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <465>   DW_AT_encoding    : 7	(unsigned)
    <465>   DW_AT_byte_size   : 1
    <465>   DW_AT_type        : <0x3d>
    <469>   DW_AT_decl_file   : 7
    <46a>   DW_AT_decl_line   : 147
    <46b>   DW_AT_decl_column : 1
    <46b>   DW_AT_sibling     : <0x488>
 <2><46f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <470>   DW_AT_name        : (indirect string, offset: 0x22d80): HAL_I2C_MODE_NONE
    <474>   DW_AT_const_value : 0
 <2><475>: Abbrev Number: 2 (DW_TAG_enumerator)
    <476>   DW_AT_name        : (indirect string, offset: 0x2754): HAL_I2C_MODE_MASTER
    <47a>   DW_AT_const_value : 16
 <2><47b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <47c>   DW_AT_name        : (indirect string, offset: 0x79987): HAL_I2C_MODE_SLAVE
    <480>   DW_AT_const_value : 32
 <2><481>: Abbrev Number: 2 (DW_TAG_enumerator)
    <482>   DW_AT_name        : (indirect string, offset: 0x2a3aa): HAL_I2C_MODE_MEM
    <486>   DW_AT_const_value : 64
 <2><487>: Abbrev Number: 0
 <1><488>: Abbrev Number: 3 (DW_TAG_typedef)
    <489>   DW_AT_name        : (indirect string, offset: 0x40e30): HAL_I2C_ModeTypeDef
    <48d>   DW_AT_decl_file   : 7
    <48e>   DW_AT_decl_line   : 153
    <48f>   DW_AT_decl_column : 3
    <490>   DW_AT_type        : <0x464>
 <1><494>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <495>   DW_AT_type        : <0x488>
 <1><499>: Abbrev Number: 14 (DW_TAG_structure_type)
    <49a>   DW_AT_byte_size   : 84
    <49b>   DW_AT_decl_file   : 7
    <49c>   DW_AT_decl_line   : 187
    <49d>   DW_AT_decl_column : 9
    <49d>   DW_AT_sibling     : <0x57f>
 <2><4a1>: Abbrev Number: 1 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0x33e9b): Instance
    <4a6>   DW_AT_decl_file   : 7
    <4a7>   DW_AT_decl_line   : 190
    <4a8>   DW_AT_decl_column : 31
    <4a9>   DW_AT_type        : <0x57f>
    <4ad>   DW_AT_data_member_location: 0
 <2><4ae>: Abbrev Number: 1 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x8587f): Init
    <4b3>   DW_AT_decl_file   : 7
    <4b4>   DW_AT_decl_line   : 192
    <4b5>   DW_AT_decl_column : 30
    <4b6>   DW_AT_type        : <0x3f9>
    <4ba>   DW_AT_data_member_location: 4
 <2><4bb>: Abbrev Number: 1 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xcfa7): pBuffPtr
    <4c0>   DW_AT_decl_file   : 7
    <4c1>   DW_AT_decl_line   : 194
    <4c2>   DW_AT_decl_column : 31
    <4c3>   DW_AT_type        : <0x584>
    <4c7>   DW_AT_data_member_location: 36
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x893e2): XferSize
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 196
    <4cf>   DW_AT_decl_column : 30
    <4d0>   DW_AT_type        : <0xa0>
    <4d4>   DW_AT_data_member_location: 40
 <2><4d5>: Abbrev Number: 1 (DW_TAG_member)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x8a1e8): XferCount
    <4da>   DW_AT_decl_file   : 7
    <4db>   DW_AT_decl_line   : 198
    <4dc>   DW_AT_decl_column : 30
    <4dd>   DW_AT_type        : <0xac>
    <4e1>   DW_AT_data_member_location: 42
 <2><4e2>: Abbrev Number: 1 (DW_TAG_member)
    <4e3>   DW_AT_name        : (indirect string, offset: 0x905e0): XferOptions
    <4e7>   DW_AT_decl_file   : 7
    <4e8>   DW_AT_decl_line   : 200
    <4e9>   DW_AT_decl_column : 30
    <4ea>   DW_AT_type        : <0xbd>
    <4ee>   DW_AT_data_member_location: 44
 <2><4ef>: Abbrev Number: 1 (DW_TAG_member)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x3b928): PreviousState
    <4f4>   DW_AT_decl_file   : 7
    <4f5>   DW_AT_decl_line   : 202
    <4f6>   DW_AT_decl_column : 30
    <4f7>   DW_AT_type        : <0xbd>
    <4fb>   DW_AT_data_member_location: 48
 <2><4fc>: Abbrev Number: 1 (DW_TAG_member)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x811ce): hdmatx
    <501>   DW_AT_decl_file   : 7
    <502>   DW_AT_decl_line   : 205
    <503>   DW_AT_decl_column : 31
    <504>   DW_AT_type        : <0x589>
    <508>   DW_AT_data_member_location: 52
 <2><509>: Abbrev Number: 1 (DW_TAG_member)
    <50a>   DW_AT_name        : (indirect string, offset: 0x8093e): hdmarx
    <50e>   DW_AT_decl_file   : 7
    <50f>   DW_AT_decl_line   : 207
    <510>   DW_AT_decl_column : 31
    <511>   DW_AT_type        : <0x589>
    <515>   DW_AT_data_member_location: 56
 <2><516>: Abbrev Number: 1 (DW_TAG_member)
    <517>   DW_AT_name        : (indirect string, offset: 0x5f61c): Lock
    <51b>   DW_AT_decl_file   : 7
    <51c>   DW_AT_decl_line   : 209
    <51d>   DW_AT_decl_column : 30
    <51e>   DW_AT_type        : <0x200>
    <522>   DW_AT_data_member_location: 60
 <2><523>: Abbrev Number: 1 (DW_TAG_member)
    <524>   DW_AT_name        : (indirect string, offset: 0x8ad0f): State
    <528>   DW_AT_decl_file   : 7
    <529>   DW_AT_decl_line   : 211
    <52a>   DW_AT_decl_column : 30
    <52b>   DW_AT_type        : <0x45f>
    <52f>   DW_AT_data_member_location: 61
 <2><530>: Abbrev Number: 1 (DW_TAG_member)
    <531>   DW_AT_name        : (indirect string, offset: 0x917e8): Mode
    <535>   DW_AT_decl_file   : 7
    <536>   DW_AT_decl_line   : 213
    <537>   DW_AT_decl_column : 30
    <538>   DW_AT_type        : <0x494>
    <53c>   DW_AT_data_member_location: 62
 <2><53d>: Abbrev Number: 1 (DW_TAG_member)
    <53e>   DW_AT_name        : (indirect string, offset: 0x819d9): ErrorCode
    <542>   DW_AT_decl_file   : 7
    <543>   DW_AT_decl_line   : 215
    <544>   DW_AT_decl_column : 30
    <545>   DW_AT_type        : <0xbd>
    <549>   DW_AT_data_member_location: 64
 <2><54a>: Abbrev Number: 1 (DW_TAG_member)
    <54b>   DW_AT_name        : (indirect string, offset: 0x56989): Devaddress
    <54f>   DW_AT_decl_file   : 7
    <550>   DW_AT_decl_line   : 217
    <551>   DW_AT_decl_column : 30
    <552>   DW_AT_type        : <0xbd>
    <556>   DW_AT_data_member_location: 68
 <2><557>: Abbrev Number: 1 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0x51aa6): Memaddress
    <55c>   DW_AT_decl_file   : 7
    <55d>   DW_AT_decl_line   : 219
    <55e>   DW_AT_decl_column : 30
    <55f>   DW_AT_type        : <0xbd>
    <563>   DW_AT_data_member_location: 72
 <2><564>: Abbrev Number: 1 (DW_TAG_member)
    <565>   DW_AT_name        : (indirect string, offset: 0x3f423): MemaddSize
    <569>   DW_AT_decl_file   : 7
    <56a>   DW_AT_decl_line   : 221
    <56b>   DW_AT_decl_column : 30
    <56c>   DW_AT_type        : <0xbd>
    <570>   DW_AT_data_member_location: 76
 <2><571>: Abbrev Number: 1 (DW_TAG_member)
    <572>   DW_AT_name        : (indirect string, offset: 0x3fa3a): EventCount
    <576>   DW_AT_decl_file   : 7
    <577>   DW_AT_decl_line   : 223
    <578>   DW_AT_decl_column : 30
    <579>   DW_AT_type        : <0xbd>
    <57d>   DW_AT_data_member_location: 80
 <2><57e>: Abbrev Number: 0
 <1><57f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <580>   DW_AT_byte_size   : 4
    <580>   DW_AT_type        : <0x1a6>
 <1><584>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <585>   DW_AT_byte_size   : 4
    <585>   DW_AT_type        : <0x94>
 <1><589>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <58a>   DW_AT_byte_size   : 4
    <58a>   DW_AT_type        : <0x37c>
 <1><58e>: Abbrev Number: 3 (DW_TAG_typedef)
    <58f>   DW_AT_name        : (indirect string, offset: 0x2da47): I2C_HandleTypeDef
    <593>   DW_AT_decl_file   : 7
    <594>   DW_AT_decl_line   : 243
    <595>   DW_AT_decl_column : 3
    <596>   DW_AT_type        : <0x499>
 <1><59a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <59b>   DW_AT_byte_size   : 12
    <59c>   DW_AT_decl_file   : 8
    <59d>   DW_AT_decl_line   : 57
    <59e>   DW_AT_decl_column : 9
    <59e>   DW_AT_sibling     : <0x618>
 <2><5a2>: Abbrev Number: 23 (DW_TAG_member)
    <5a3>   DW_AT_name        : I2C
    <5a7>   DW_AT_decl_file   : 8
    <5a8>   DW_AT_decl_line   : 59
    <5a9>   DW_AT_decl_column : 21
    <5aa>   DW_AT_type        : <0x618>
    <5ae>   DW_AT_data_member_location: 0
 <2><5af>: Abbrev Number: 1 (DW_TAG_member)
    <5b0>   DW_AT_name        : (indirect string, offset: 0x23af7): ADDRESS
    <5b4>   DW_AT_decl_file   : 8
    <5b5>   DW_AT_decl_line   : 60
    <5b6>   DW_AT_decl_column : 10
    <5b7>   DW_AT_type        : <0x94>
    <5bb>   DW_AT_data_member_location: 4
 <2><5bc>: Abbrev Number: 1 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x1d8fa): COLUMS
    <5c1>   DW_AT_decl_file   : 8
    <5c2>   DW_AT_decl_line   : 61
    <5c3>   DW_AT_decl_column : 10
    <5c4>   DW_AT_type        : <0x94>
    <5c8>   DW_AT_data_member_location: 5
 <2><5c9>: Abbrev Number: 1 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x5450f): ROWS
    <5ce>   DW_AT_decl_file   : 8
    <5cf>   DW_AT_decl_line   : 62
    <5d0>   DW_AT_decl_column : 10
    <5d1>   DW_AT_type        : <0x94>
    <5d5>   DW_AT_data_member_location: 6
 <2><5d6>: Abbrev Number: 1 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x63273): ENTRYMODE
    <5db>   DW_AT_decl_file   : 8
    <5dc>   DW_AT_decl_line   : 63
    <5dd>   DW_AT_decl_column : 10
    <5de>   DW_AT_type        : <0x94>
    <5e2>   DW_AT_data_member_location: 7
 <2><5e3>: Abbrev Number: 1 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x25088): DISPLAYCTRL
    <5e8>   DW_AT_decl_file   : 8
    <5e9>   DW_AT_decl_line   : 64
    <5ea>   DW_AT_decl_column : 10
    <5eb>   DW_AT_type        : <0x94>
    <5ef>   DW_AT_data_member_location: 8
 <2><5f0>: Abbrev Number: 1 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x7b924): CURSORSHIFT
    <5f5>   DW_AT_decl_file   : 8
    <5f6>   DW_AT_decl_line   : 65
    <5f7>   DW_AT_decl_column : 10
    <5f8>   DW_AT_type        : <0x94>
    <5fc>   DW_AT_data_member_location: 9
 <2><5fd>: Abbrev Number: 1 (DW_TAG_member)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x67dbc): FUNCTIONSET
    <602>   DW_AT_decl_file   : 8
    <603>   DW_AT_decl_line   : 66
    <604>   DW_AT_decl_column : 10
    <605>   DW_AT_type        : <0x94>
    <609>   DW_AT_data_member_location: 10
 <2><60a>: Abbrev Number: 1 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x42dce): BACKLIGHT
    <60f>   DW_AT_decl_file   : 8
    <610>   DW_AT_decl_line   : 67
    <611>   DW_AT_decl_column : 10
    <612>   DW_AT_type        : <0x94>
    <616>   DW_AT_data_member_location: 11
 <2><617>: Abbrev Number: 0
 <1><618>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <619>   DW_AT_byte_size   : 4
    <619>   DW_AT_type        : <0x58e>
 <1><61d>: Abbrev Number: 3 (DW_TAG_typedef)
    <61e>   DW_AT_name        : (indirect string, offset: 0x45b38): CLCD_I2C_Name
    <622>   DW_AT_decl_file   : 8
    <623>   DW_AT_decl_line   : 68
    <624>   DW_AT_decl_column : 2
    <625>   DW_AT_type        : <0x59a>
 <1><629>: Abbrev Number: 24 (DW_TAG_subprogram)
    <62a>   DW_AT_external    : 1
    <62a>   DW_AT_name        : (indirect string, offset: 0x331b1): HAL_I2C_Master_Transmit
    <62e>   DW_AT_decl_file   : 7
    <62f>   DW_AT_decl_line   : 563
    <631>   DW_AT_decl_column : 19
    <632>   DW_AT_prototyped  : 1
    <632>   DW_AT_type        : <0x1dc>
    <636>   DW_AT_declaration : 1
    <636>   DW_AT_sibling     : <0x654>
 <2><63a>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <63b>   DW_AT_type        : <0x618>
 <2><63f>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <640>   DW_AT_type        : <0xa0>
 <2><644>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <645>   DW_AT_type        : <0x584>
 <2><649>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <64a>   DW_AT_type        : <0xa0>
 <2><64e>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <64f>   DW_AT_type        : <0xb1>
 <2><653>: Abbrev Number: 0
 <1><654>: Abbrev Number: 25 (DW_TAG_subprogram)
    <655>   DW_AT_external    : 1
    <655>   DW_AT_name        : (indirect string, offset: 0x353cc): HAL_Delay
    <659>   DW_AT_decl_file   : 9
    <65a>   DW_AT_decl_line   : 296
    <65c>   DW_AT_decl_column : 6
    <65d>   DW_AT_prototyped  : 1
    <65d>   DW_AT_declaration : 1
    <65d>   DW_AT_sibling     : <0x667>
 <2><661>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <662>   DW_AT_type        : <0xb1>
 <2><666>: Abbrev Number: 0
 <1><667>: Abbrev Number: 8 (DW_TAG_subprogram)
    <668>   DW_AT_external    : 1
    <668>   DW_AT_name        : (indirect string, offset: 0x5864c): CLCD_I2C_BlinkOff
    <66c>   DW_AT_decl_file   : 1
    <66c>   DW_AT_decl_line   : 147
    <66d>   DW_AT_decl_column : 6
    <66d>   DW_AT_prototyped  : 1
    <66d>   DW_AT_low_pc      : 0
    <671>   DW_AT_high_pc     : 0x2c
    <675>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <677>   DW_AT_call_all_tail_calls: 1
    <677>   DW_AT_sibling     : <0x68a>
 <2><67b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <67c>   DW_AT_name        : LCD
    <680>   DW_AT_decl_file   : 1
    <680>   DW_AT_decl_line   : 147
    <681>   DW_AT_decl_column : 39
    <682>   DW_AT_type        : <0x68a>
    <686>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><689>: Abbrev Number: 0
 <1><68a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <68b>   DW_AT_byte_size   : 4
    <68b>   DW_AT_type        : <0x61d>
 <1><68f>: Abbrev Number: 8 (DW_TAG_subprogram)
    <690>   DW_AT_external    : 1
    <690>   DW_AT_name        : (indirect string, offset: 0x762eb): CLCD_I2C_BlinkOn
    <694>   DW_AT_decl_file   : 1
    <694>   DW_AT_decl_line   : 142
    <695>   DW_AT_decl_column : 6
    <695>   DW_AT_prototyped  : 1
    <695>   DW_AT_low_pc      : 0
    <699>   DW_AT_high_pc     : 0x2c
    <69d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <69f>   DW_AT_call_all_tail_calls: 1
    <69f>   DW_AT_sibling     : <0x6b2>
 <2><6a3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6a4>   DW_AT_name        : LCD
    <6a8>   DW_AT_decl_file   : 1
    <6a8>   DW_AT_decl_line   : 142
    <6a9>   DW_AT_decl_column : 38
    <6aa>   DW_AT_type        : <0x68a>
    <6ae>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><6b1>: Abbrev Number: 0
 <1><6b2>: Abbrev Number: 8 (DW_TAG_subprogram)
    <6b3>   DW_AT_external    : 1
    <6b3>   DW_AT_name        : (indirect string, offset: 0x6c79e): CLCD_I2C_CursorOff
    <6b7>   DW_AT_decl_file   : 1
    <6b7>   DW_AT_decl_line   : 137
    <6b8>   DW_AT_decl_column : 6
    <6b8>   DW_AT_prototyped  : 1
    <6b8>   DW_AT_low_pc      : 0
    <6bc>   DW_AT_high_pc     : 0x2c
    <6c0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6c2>   DW_AT_call_all_tail_calls: 1
    <6c2>   DW_AT_sibling     : <0x6d5>
 <2><6c6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6c7>   DW_AT_name        : LCD
    <6cb>   DW_AT_decl_file   : 1
    <6cb>   DW_AT_decl_line   : 137
    <6cc>   DW_AT_decl_column : 40
    <6cd>   DW_AT_type        : <0x68a>
    <6d1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><6d4>: Abbrev Number: 0
 <1><6d5>: Abbrev Number: 8 (DW_TAG_subprogram)
    <6d6>   DW_AT_external    : 1
    <6d6>   DW_AT_name        : (indirect string, offset: 0x382d6): CLCD_I2C_CursorOn
    <6da>   DW_AT_decl_file   : 1
    <6da>   DW_AT_decl_line   : 132
    <6db>   DW_AT_decl_column : 6
    <6db>   DW_AT_prototyped  : 1
    <6db>   DW_AT_low_pc      : 0
    <6df>   DW_AT_high_pc     : 0x2c
    <6e3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6e5>   DW_AT_call_all_tail_calls: 1
    <6e5>   DW_AT_sibling     : <0x6f8>
 <2><6e9>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6ea>   DW_AT_name        : LCD
    <6ee>   DW_AT_decl_file   : 1
    <6ee>   DW_AT_decl_line   : 132
    <6ef>   DW_AT_decl_column : 39
    <6f0>   DW_AT_type        : <0x68a>
    <6f4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><6f7>: Abbrev Number: 0
 <1><6f8>: Abbrev Number: 8 (DW_TAG_subprogram)
    <6f9>   DW_AT_external    : 1
    <6f9>   DW_AT_name        : (indirect string, offset: 0x1af89): CLCD_I2C_ReturnHome
    <6fd>   DW_AT_decl_file   : 1
    <6fd>   DW_AT_decl_line   : 127
    <6fe>   DW_AT_decl_column : 6
    <6fe>   DW_AT_prototyped  : 1
    <6fe>   DW_AT_low_pc      : 0
    <702>   DW_AT_high_pc     : 0x20
    <706>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <708>   DW_AT_call_all_tail_calls: 1
    <708>   DW_AT_sibling     : <0x71b>
 <2><70c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <70d>   DW_AT_name        : LCD
    <711>   DW_AT_decl_file   : 1
    <711>   DW_AT_decl_line   : 127
    <712>   DW_AT_decl_column : 41
    <713>   DW_AT_type        : <0x68a>
    <717>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><71a>: Abbrev Number: 0
 <1><71b>: Abbrev Number: 8 (DW_TAG_subprogram)
    <71c>   DW_AT_external    : 1
    <71c>   DW_AT_name        : (indirect string, offset: 0x57ebe): CLCD_I2C_Clear
    <720>   DW_AT_decl_file   : 1
    <720>   DW_AT_decl_line   : 122
    <721>   DW_AT_decl_column : 6
    <721>   DW_AT_prototyped  : 1
    <721>   DW_AT_low_pc      : 0x80010ac
    <725>   DW_AT_high_pc     : 0x20
    <729>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <72b>   DW_AT_call_all_tail_calls: 1
    <72b>   DW_AT_sibling     : <0x73e>
 <2><72f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <730>   DW_AT_name        : LCD
    <734>   DW_AT_decl_file   : 1
    <734>   DW_AT_decl_line   : 122
    <735>   DW_AT_decl_column : 36
    <736>   DW_AT_type        : <0x68a>
    <73a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><73d>: Abbrev Number: 0
 <1><73e>: Abbrev Number: 8 (DW_TAG_subprogram)
    <73f>   DW_AT_external    : 1
    <73f>   DW_AT_name        : (indirect string, offset: 0x34f5d): CLCD_I2C_WriteString
    <743>   DW_AT_decl_file   : 1
    <743>   DW_AT_decl_line   : 118
    <744>   DW_AT_decl_column : 6
    <744>   DW_AT_prototyped  : 1
    <744>   DW_AT_low_pc      : 0x800107e
    <748>   DW_AT_high_pc     : 0x2e
    <74c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <74e>   DW_AT_call_all_tail_calls: 1
    <74e>   DW_AT_sibling     : <0x76f>
 <2><752>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <753>   DW_AT_name        : LCD
    <757>   DW_AT_decl_file   : 1
    <757>   DW_AT_decl_line   : 118
    <758>   DW_AT_decl_column : 42
    <759>   DW_AT_type        : <0x68a>
    <75d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><760>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <761>   DW_AT_name        : (indirect string, offset: 0x34f6b): String
    <765>   DW_AT_decl_file   : 1
    <765>   DW_AT_decl_line   : 118
    <766>   DW_AT_decl_column : 53
    <767>   DW_AT_type        : <0x76f>
    <76b>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><76e>: Abbrev Number: 0
 <1><76f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <770>   DW_AT_byte_size   : 4
    <770>   DW_AT_type        : <0x774>
 <1><774>: Abbrev Number: 4 (DW_TAG_base_type)
    <775>   DW_AT_byte_size   : 1
    <776>   DW_AT_encoding    : 8	(unsigned char)
    <777>   DW_AT_name        : (indirect string, offset: 0x88144): char
 <1><77b>: Abbrev Number: 8 (DW_TAG_subprogram)
    <77c>   DW_AT_external    : 1
    <77c>   DW_AT_name        : (indirect string, offset: 0x74949): CLCD_I2C_WriteChar
    <780>   DW_AT_decl_file   : 1
    <780>   DW_AT_decl_line   : 114
    <781>   DW_AT_decl_column : 6
    <781>   DW_AT_prototyped  : 1
    <781>   DW_AT_low_pc      : 0x800105e
    <785>   DW_AT_high_pc     : 0x20
    <789>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <78b>   DW_AT_call_all_tail_calls: 1
    <78b>   DW_AT_sibling     : <0x7ac>
 <2><78f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <790>   DW_AT_name        : LCD
    <794>   DW_AT_decl_file   : 1
    <794>   DW_AT_decl_line   : 114
    <795>   DW_AT_decl_column : 40
    <796>   DW_AT_type        : <0x68a>
    <79a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><79d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <79e>   DW_AT_name        : (indirect string, offset: 0x664de): character
    <7a2>   DW_AT_decl_file   : 1
    <7a2>   DW_AT_decl_line   : 114
    <7a3>   DW_AT_decl_column : 50
    <7a4>   DW_AT_type        : <0x774>
    <7a8>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><7ab>: Abbrev Number: 0
 <1><7ac>: Abbrev Number: 8 (DW_TAG_subprogram)
    <7ad>   DW_AT_external    : 1
    <7ad>   DW_AT_name        : (indirect string, offset: 0x146f0): CLCD_I2C_SetCursor
    <7b1>   DW_AT_decl_file   : 1
    <7b1>   DW_AT_decl_line   : 85
    <7b2>   DW_AT_decl_column : 6
    <7b2>   DW_AT_prototyped  : 1
    <7b2>   DW_AT_low_pc      : 0x8000fd8
    <7b6>   DW_AT_high_pc     : 0x86
    <7ba>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7bc>   DW_AT_call_all_tail_calls: 1
    <7bc>   DW_AT_sibling     : <0x7f9>
 <2><7c0>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7c1>   DW_AT_name        : LCD
    <7c5>   DW_AT_decl_file   : 1
    <7c5>   DW_AT_decl_line   : 85
    <7c6>   DW_AT_decl_column : 40
    <7c7>   DW_AT_type        : <0x68a>
    <7cb>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7ce>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <7cf>   DW_AT_name        : (indirect string, offset: 0x28fbd): Xpos
    <7d3>   DW_AT_decl_file   : 1
    <7d3>   DW_AT_decl_line   : 85
    <7d4>   DW_AT_decl_column : 53
    <7d5>   DW_AT_type        : <0x94>
    <7d9>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><7dc>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x419c1): Ypos
    <7e1>   DW_AT_decl_file   : 1
    <7e1>   DW_AT_decl_line   : 85
    <7e2>   DW_AT_decl_column : 67
    <7e3>   DW_AT_type        : <0x94>
    <7e7>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><7ea>: Abbrev Number: 15 (DW_TAG_variable)
    <7eb>   DW_AT_name        : (indirect string, offset: 0x23386): DRAM_ADDRESS
    <7ef>   DW_AT_decl_file   : 1
    <7ef>   DW_AT_decl_line   : 87
    <7f0>   DW_AT_decl_column : 10
    <7f1>   DW_AT_type        : <0x94>
    <7f5>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><7f8>: Abbrev Number: 0
 <1><7f9>: Abbrev Number: 8 (DW_TAG_subprogram)
    <7fa>   DW_AT_external    : 1
    <7fa>   DW_AT_name        : (indirect string, offset: 0x1b52b): CLCD_I2C_Init
    <7fe>   DW_AT_decl_file   : 1
    <7fe>   DW_AT_decl_line   : 54
    <7ff>   DW_AT_decl_column : 6
    <7ff>   DW_AT_prototyped  : 1
    <7ff>   DW_AT_low_pc      : 0x8000ef8
    <803>   DW_AT_high_pc     : 0xe0
    <807>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <809>   DW_AT_call_all_tail_calls: 1
    <809>   DW_AT_sibling     : <0x854>
 <2><80d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <80e>   DW_AT_name        : LCD
    <812>   DW_AT_decl_file   : 1
    <812>   DW_AT_decl_line   : 54
    <813>   DW_AT_decl_column : 35
    <814>   DW_AT_type        : <0x68a>
    <818>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><81b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <81c>   DW_AT_name        : (indirect string, offset: 0x2ef58): hi2c_CLCD
    <820>   DW_AT_decl_file   : 1
    <820>   DW_AT_decl_line   : 54
    <821>   DW_AT_decl_column : 59
    <822>   DW_AT_type        : <0x618>
    <826>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><829>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <82a>   DW_AT_name        : (indirect string, offset: 0x392de): Address
    <82e>   DW_AT_decl_file   : 1
    <82e>   DW_AT_decl_line   : 54
    <82f>   DW_AT_decl_column : 78
    <830>   DW_AT_type        : <0x94>
    <834>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><837>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <838>   DW_AT_name        : (indirect string, offset: 0x73144): Colums
    <83c>   DW_AT_decl_file   : 1
    <83c>   DW_AT_decl_line   : 54
    <83d>   DW_AT_decl_column : 95
    <83e>   DW_AT_type        : <0x94>
    <842>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><845>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <846>   DW_AT_name        : (indirect string, offset: 0xb449): Rows
    <84a>   DW_AT_decl_file   : 1
    <84a>   DW_AT_decl_line   : 54
    <84b>   DW_AT_decl_column : 111
    <84c>   DW_AT_type        : <0x94>
    <850>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><853>: Abbrev Number: 0
 <1><854>: Abbrev Number: 26 (DW_TAG_subprogram)
    <855>   DW_AT_name        : (indirect string, offset: 0x149b6): CLCD_WriteI2C
    <859>   DW_AT_decl_file   : 1
    <85a>   DW_AT_decl_line   : 21
    <85b>   DW_AT_decl_column : 13
    <85c>   DW_AT_prototyped  : 1
    <85c>   DW_AT_low_pc      : 0x8000e4a
    <860>   DW_AT_high_pc     : 0xae
    <864>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <866>   DW_AT_call_all_tail_calls: 1
    <866>   DW_AT_sibling     : <0x8bf>
 <2><86a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <86b>   DW_AT_name        : LCD
    <86f>   DW_AT_decl_file   : 1
    <86f>   DW_AT_decl_line   : 21
    <870>   DW_AT_decl_column : 42
    <871>   DW_AT_type        : <0x68a>
    <875>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><878>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <879>   DW_AT_name        : (indirect string, offset: 0x906d8): Data
    <87d>   DW_AT_decl_file   : 1
    <87d>   DW_AT_decl_line   : 21
    <87e>   DW_AT_decl_column : 55
    <87f>   DW_AT_type        : <0x94>
    <883>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><886>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <887>   DW_AT_name        : (indirect string, offset: 0x917e8): Mode
    <88b>   DW_AT_decl_file   : 1
    <88b>   DW_AT_decl_line   : 21
    <88c>   DW_AT_decl_column : 69
    <88d>   DW_AT_type        : <0x94>
    <891>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><894>: Abbrev Number: 15 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0x3fe5d): Data_H
    <899>   DW_AT_decl_file   : 1
    <899>   DW_AT_decl_line   : 23
    <89a>   DW_AT_decl_column : 7
    <89b>   DW_AT_type        : <0x774>
    <89f>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><8a2>: Abbrev Number: 15 (DW_TAG_variable)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x7a09b): Data_L
    <8a7>   DW_AT_decl_file   : 1
    <8a7>   DW_AT_decl_line   : 24
    <8a8>   DW_AT_decl_column : 7
    <8a9>   DW_AT_type        : <0x774>
    <8ad>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><8b0>: Abbrev Number: 15 (DW_TAG_variable)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x80445): Data_I2C
    <8b5>   DW_AT_decl_file   : 1
    <8b5>   DW_AT_decl_line   : 25
    <8b6>   DW_AT_decl_column : 10
    <8b7>   DW_AT_type        : <0x8bf>
    <8bb>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8be>: Abbrev Number: 0
 <1><8bf>: Abbrev Number: 27 (DW_TAG_array_type)
    <8c0>   DW_AT_type        : <0x94>
    <8c4>   DW_AT_sibling     : <0x8cf>
 <2><8c8>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <8c9>   DW_AT_type        : <0x8d>
    <8cd>   DW_AT_upper_bound : 3
 <2><8ce>: Abbrev Number: 0
 <1><8cf>: Abbrev Number: 29 (DW_TAG_subprogram)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x1ca85): CLCD_Delay
    <8d4>   DW_AT_decl_file   : 1
    <8d5>   DW_AT_decl_line   : 17
    <8d6>   DW_AT_decl_column : 13
    <8d7>   DW_AT_prototyped  : 1
    <8d7>   DW_AT_low_pc      : 0x8000e30
    <8db>   DW_AT_high_pc     : 0x1a
    <8df>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8e1>   DW_AT_call_all_tail_calls: 1
 <2><8e1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x921ad): Time
    <8e6>   DW_AT_decl_file   : 1
    <8e6>   DW_AT_decl_line   : 17
    <8e7>   DW_AT_decl_column : 33
    <8e8>   DW_AT_type        : <0xa0>
    <8ec>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><8ef>: Abbrev Number: 0
 <1><8f0>: Abbrev Number: 0
  Compilation Unit @ offset 0x8f1:
   Length:        0x6b7 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1ce
   Pointer Size:  4
 <0><8fd>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <8fe>   DW_AT_producer    : (indirect string, offset: 0x1a9b8): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <902>   DW_AT_language    : 29	(C11)
    <903>   DW_AT_name        : (indirect string, offset: 0x8553b): ../Core/Src/delay_timer.c
    <907>   DW_AT_comp_dir    : (indirect string, offset: 0x125aa): C:/Users/tanla/STM32CubeIDE/workspace_1.15.1/TKHTN/Debug
    <90b>   DW_AT_ranges      : 0x64
    <90f>   DW_AT_low_pc      : 0
    <913>   DW_AT_stmt_list   : 0x8da
    <917>   DW_AT_macros      : 0x15ce1
 <1><91b>: Abbrev Number: 5 (DW_TAG_base_type)
    <91c>   DW_AT_byte_size   : 1
    <91d>   DW_AT_encoding    : 6	(signed char)
    <91e>   DW_AT_name        : (indirect string, offset: 0x42eae): signed char
 <1><922>: Abbrev Number: 5 (DW_TAG_base_type)
    <923>   DW_AT_byte_size   : 1
    <924>   DW_AT_encoding    : 8	(unsigned char)
    <925>   DW_AT_name        : (indirect string, offset: 0x1af4b): unsigned char
 <1><929>: Abbrev Number: 5 (DW_TAG_base_type)
    <92a>   DW_AT_byte_size   : 2
    <92b>   DW_AT_encoding    : 5	(signed)
    <92c>   DW_AT_name        : (indirect string, offset: 0x63a9f): short int
 <1><930>: Abbrev Number: 6 (DW_TAG_typedef)
    <931>   DW_AT_name        : (indirect string, offset: 0x6d592): __uint16_t
    <935>   DW_AT_decl_file   : 2
    <936>   DW_AT_decl_line   : 57
    <937>   DW_AT_decl_column : 25
    <938>   DW_AT_type        : <0x93c>
 <1><93c>: Abbrev Number: 5 (DW_TAG_base_type)
    <93d>   DW_AT_byte_size   : 2
    <93e>   DW_AT_encoding    : 7	(unsigned)
    <93f>   DW_AT_name        : (indirect string, offset: 0x2b9b0): short unsigned int
 <1><943>: Abbrev Number: 5 (DW_TAG_base_type)
    <944>   DW_AT_byte_size   : 4
    <945>   DW_AT_encoding    : 5	(signed)
    <946>   DW_AT_name        : (indirect string, offset: 0xb9ac): long int
 <1><94a>: Abbrev Number: 6 (DW_TAG_typedef)
    <94b>   DW_AT_name        : (indirect string, offset: 0x5501d): __uint32_t
    <94f>   DW_AT_decl_file   : 2
    <950>   DW_AT_decl_line   : 79
    <951>   DW_AT_decl_column : 25
    <952>   DW_AT_type        : <0x956>
 <1><956>: Abbrev Number: 5 (DW_TAG_base_type)
    <957>   DW_AT_byte_size   : 4
    <958>   DW_AT_encoding    : 7	(unsigned)
    <959>   DW_AT_name        : (indirect string, offset: 0x1f388): long unsigned int
 <1><95d>: Abbrev Number: 5 (DW_TAG_base_type)
    <95e>   DW_AT_byte_size   : 8
    <95f>   DW_AT_encoding    : 5	(signed)
    <960>   DW_AT_name        : (indirect string, offset: 0x3d3c0): long long int
 <1><964>: Abbrev Number: 5 (DW_TAG_base_type)
    <965>   DW_AT_byte_size   : 8
    <966>   DW_AT_encoding    : 7	(unsigned)
    <967>   DW_AT_name        : (indirect string, offset: 0x1b7b6): long long unsigned int
 <1><96b>: Abbrev Number: 20 (DW_TAG_base_type)
    <96c>   DW_AT_byte_size   : 4
    <96d>   DW_AT_encoding    : 5	(signed)
    <96e>   DW_AT_name        : int
 <1><972>: Abbrev Number: 5 (DW_TAG_base_type)
    <973>   DW_AT_byte_size   : 4
    <974>   DW_AT_encoding    : 7	(unsigned)
    <975>   DW_AT_name        : (indirect string, offset: 0xb339): unsigned int
 <1><979>: Abbrev Number: 6 (DW_TAG_typedef)
    <97a>   DW_AT_name        : (indirect string, offset: 0x8b3b6): uint16_t
    <97e>   DW_AT_decl_file   : 3
    <97f>   DW_AT_decl_line   : 36
    <980>   DW_AT_decl_column : 20
    <981>   DW_AT_type        : <0x930>
 <1><985>: Abbrev Number: 6 (DW_TAG_typedef)
    <986>   DW_AT_name        : (indirect string, offset: 0x8b384): uint32_t
    <98a>   DW_AT_decl_file   : 3
    <98b>   DW_AT_decl_line   : 48
    <98c>   DW_AT_decl_column : 20
    <98d>   DW_AT_type        : <0x94a>
 <1><991>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <992>   DW_AT_type        : <0x985>
 <1><996>: Abbrev Number: 11 (DW_TAG_structure_type)
    <997>   DW_AT_byte_size   : 16
    <998>   DW_AT_decl_file   : 4
    <999>   DW_AT_decl_line   : 290
    <99b>   DW_AT_decl_column : 9
    <99b>   DW_AT_sibling     : <0x9d6>
 <2><99f>: Abbrev Number: 4 (DW_TAG_member)
    <9a0>   DW_AT_name        : CCR
    <9a4>   DW_AT_decl_file   : 4
    <9a4>   DW_AT_decl_line   : 292
    <9a6>   DW_AT_decl_column : 17
    <9a6>   DW_AT_type        : <0x991>
    <9aa>   DW_AT_data_member_location: 0
 <2><9ab>: Abbrev Number: 3 (DW_TAG_member)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x337f3): CNDTR
    <9b0>   DW_AT_decl_file   : 4
    <9b1>   DW_AT_decl_line   : 293
    <9b3>   DW_AT_decl_column : 17
    <9b4>   DW_AT_type        : <0x991>
    <9b8>   DW_AT_data_member_location: 4
 <2><9b9>: Abbrev Number: 3 (DW_TAG_member)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x800ee): CPAR
    <9be>   DW_AT_decl_file   : 4
    <9bf>   DW_AT_decl_line   : 294
    <9c1>   DW_AT_decl_column : 17
    <9c2>   DW_AT_type        : <0x991>
    <9c6>   DW_AT_data_member_location: 8
 <2><9c7>: Abbrev Number: 3 (DW_TAG_member)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x49b1c): CMAR
    <9cc>   DW_AT_decl_file   : 4
    <9cd>   DW_AT_decl_line   : 295
    <9cf>   DW_AT_decl_column : 17
    <9d0>   DW_AT_type        : <0x991>
    <9d4>   DW_AT_data_member_location: 12
 <2><9d5>: Abbrev Number: 0
 <1><9d6>: Abbrev Number: 7 (DW_TAG_typedef)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x6cd98): DMA_Channel_TypeDef
    <9db>   DW_AT_decl_file   : 4
    <9dc>   DW_AT_decl_line   : 296
    <9de>   DW_AT_decl_column : 3
    <9df>   DW_AT_type        : <0x996>
 <1><9e3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9e4>   DW_AT_byte_size   : 8
    <9e5>   DW_AT_decl_file   : 4
    <9e6>   DW_AT_decl_line   : 298
    <9e8>   DW_AT_decl_column : 9
    <9e8>   DW_AT_sibling     : <0xa07>
 <2><9ec>: Abbrev Number: 4 (DW_TAG_member)
    <9ed>   DW_AT_name        : ISR
    <9f1>   DW_AT_decl_file   : 4
    <9f1>   DW_AT_decl_line   : 300
    <9f3>   DW_AT_decl_column : 17
    <9f3>   DW_AT_type        : <0x991>
    <9f7>   DW_AT_data_member_location: 0
 <2><9f8>: Abbrev Number: 3 (DW_TAG_member)
    <9f9>   DW_AT_name        : (indirect string, offset: 0x5db71): IFCR
    <9fd>   DW_AT_decl_file   : 4
    <9fe>   DW_AT_decl_line   : 301
    <a00>   DW_AT_decl_column : 17
    <a01>   DW_AT_type        : <0x991>
    <a05>   DW_AT_data_member_location: 4
 <2><a06>: Abbrev Number: 0
 <1><a07>: Abbrev Number: 7 (DW_TAG_typedef)
    <a08>   DW_AT_name        : (indirect string, offset: 0x3075e): DMA_TypeDef
    <a0c>   DW_AT_decl_file   : 4
    <a0d>   DW_AT_decl_line   : 302
    <a0f>   DW_AT_decl_column : 3
    <a10>   DW_AT_type        : <0x9e3>
 <1><a14>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a15>   DW_AT_byte_size   : 84
    <a16>   DW_AT_decl_file   : 4
    <a17>   DW_AT_decl_line   : 476
    <a19>   DW_AT_decl_column : 9
    <a19>   DW_AT_sibling     : <0xb2e>
 <2><a1d>: Abbrev Number: 4 (DW_TAG_member)
    <a1e>   DW_AT_name        : CR1
    <a22>   DW_AT_decl_file   : 4
    <a22>   DW_AT_decl_line   : 478
    <a24>   DW_AT_decl_column : 17
    <a24>   DW_AT_type        : <0x991>
    <a28>   DW_AT_data_member_location: 0
 <2><a29>: Abbrev Number: 4 (DW_TAG_member)
    <a2a>   DW_AT_name        : CR2
    <a2e>   DW_AT_decl_file   : 4
    <a2e>   DW_AT_decl_line   : 479
    <a30>   DW_AT_decl_column : 17
    <a30>   DW_AT_type        : <0x991>
    <a34>   DW_AT_data_member_location: 4
 <2><a35>: Abbrev Number: 3 (DW_TAG_member)
    <a36>   DW_AT_name        : (indirect string, offset: 0x6022c): SMCR
    <a3a>   DW_AT_decl_file   : 4
    <a3b>   DW_AT_decl_line   : 480
    <a3d>   DW_AT_decl_column : 17
    <a3e>   DW_AT_type        : <0x991>
    <a42>   DW_AT_data_member_location: 8
 <2><a43>: Abbrev Number: 3 (DW_TAG_member)
    <a44>   DW_AT_name        : (indirect string, offset: 0x2a8cd): DIER
    <a48>   DW_AT_decl_file   : 4
    <a49>   DW_AT_decl_line   : 481
    <a4b>   DW_AT_decl_column : 17
    <a4c>   DW_AT_type        : <0x991>
    <a50>   DW_AT_data_member_location: 12
 <2><a51>: Abbrev Number: 4 (DW_TAG_member)
    <a52>   DW_AT_name        : SR
    <a55>   DW_AT_decl_file   : 4
    <a55>   DW_AT_decl_line   : 482
    <a57>   DW_AT_decl_column : 17
    <a57>   DW_AT_type        : <0x991>
    <a5b>   DW_AT_data_member_location: 16
 <2><a5c>: Abbrev Number: 4 (DW_TAG_member)
    <a5d>   DW_AT_name        : EGR
    <a61>   DW_AT_decl_file   : 4
    <a61>   DW_AT_decl_line   : 483
    <a63>   DW_AT_decl_column : 17
    <a63>   DW_AT_type        : <0x991>
    <a67>   DW_AT_data_member_location: 20
 <2><a68>: Abbrev Number: 3 (DW_TAG_member)
    <a69>   DW_AT_name        : (indirect string, offset: 0x61de7): CCMR1
    <a6d>   DW_AT_decl_file   : 4
    <a6e>   DW_AT_decl_line   : 484
    <a70>   DW_AT_decl_column : 17
    <a71>   DW_AT_type        : <0x991>
    <a75>   DW_AT_data_member_location: 24
 <2><a76>: Abbrev Number: 3 (DW_TAG_member)
    <a77>   DW_AT_name        : (indirect string, offset: 0x35452): CCMR2
    <a7b>   DW_AT_decl_file   : 4
    <a7c>   DW_AT_decl_line   : 485
    <a7e>   DW_AT_decl_column : 17
    <a7f>   DW_AT_type        : <0x991>
    <a83>   DW_AT_data_member_location: 28
 <2><a84>: Abbrev Number: 3 (DW_TAG_member)
    <a85>   DW_AT_name        : (indirect string, offset: 0x17735): CCER
    <a89>   DW_AT_decl_file   : 4
    <a8a>   DW_AT_decl_line   : 486
    <a8c>   DW_AT_decl_column : 17
    <a8d>   DW_AT_type        : <0x991>
    <a91>   DW_AT_data_member_location: 32
 <2><a92>: Abbrev Number: 4 (DW_TAG_member)
    <a93>   DW_AT_name        : CNT
    <a97>   DW_AT_decl_file   : 4
    <a97>   DW_AT_decl_line   : 487
    <a99>   DW_AT_decl_column : 17
    <a99>   DW_AT_type        : <0x991>
    <a9d>   DW_AT_data_member_location: 36
 <2><a9e>: Abbrev Number: 4 (DW_TAG_member)
    <a9f>   DW_AT_name        : PSC
    <aa3>   DW_AT_decl_file   : 4
    <aa3>   DW_AT_decl_line   : 488
    <aa5>   DW_AT_decl_column : 17
    <aa5>   DW_AT_type        : <0x991>
    <aa9>   DW_AT_data_member_location: 40
 <2><aaa>: Abbrev Number: 4 (DW_TAG_member)
    <aab>   DW_AT_name        : ARR
    <aaf>   DW_AT_decl_file   : 4
    <aaf>   DW_AT_decl_line   : 489
    <ab1>   DW_AT_decl_column : 17
    <ab1>   DW_AT_type        : <0x991>
    <ab5>   DW_AT_data_member_location: 44
 <2><ab6>: Abbrev Number: 4 (DW_TAG_member)
    <ab7>   DW_AT_name        : RCR
    <abb>   DW_AT_decl_file   : 4
    <abb>   DW_AT_decl_line   : 490
    <abd>   DW_AT_decl_column : 17
    <abd>   DW_AT_type        : <0x991>
    <ac1>   DW_AT_data_member_location: 48
 <2><ac2>: Abbrev Number: 3 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0xfdba): CCR1
    <ac7>   DW_AT_decl_file   : 4
    <ac8>   DW_AT_decl_line   : 491
    <aca>   DW_AT_decl_column : 17
    <acb>   DW_AT_type        : <0x991>
    <acf>   DW_AT_data_member_location: 52
 <2><ad0>: Abbrev Number: 3 (DW_TAG_member)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x38528): CCR2
    <ad5>   DW_AT_decl_file   : 4
    <ad6>   DW_AT_decl_line   : 492
    <ad8>   DW_AT_decl_column : 17
    <ad9>   DW_AT_type        : <0x991>
    <add>   DW_AT_data_member_location: 56
 <2><ade>: Abbrev Number: 3 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x66771): CCR3
    <ae3>   DW_AT_decl_file   : 4
    <ae4>   DW_AT_decl_line   : 493
    <ae6>   DW_AT_decl_column : 17
    <ae7>   DW_AT_type        : <0x991>
    <aeb>   DW_AT_data_member_location: 60
 <2><aec>: Abbrev Number: 3 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0x87d6): CCR4
    <af1>   DW_AT_decl_file   : 4
    <af2>   DW_AT_decl_line   : 494
    <af4>   DW_AT_decl_column : 17
    <af5>   DW_AT_type        : <0x991>
    <af9>   DW_AT_data_member_location: 64
 <2><afa>: Abbrev Number: 3 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0x3dc68): BDTR
    <aff>   DW_AT_decl_file   : 4
    <b00>   DW_AT_decl_line   : 495
    <b02>   DW_AT_decl_column : 17
    <b03>   DW_AT_type        : <0x991>
    <b07>   DW_AT_data_member_location: 68
 <2><b08>: Abbrev Number: 4 (DW_TAG_member)
    <b09>   DW_AT_name        : DCR
    <b0d>   DW_AT_decl_file   : 4
    <b0d>   DW_AT_decl_line   : 496
    <b0f>   DW_AT_decl_column : 17
    <b0f>   DW_AT_type        : <0x991>
    <b13>   DW_AT_data_member_location: 72
 <2><b14>: Abbrev Number: 3 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0x72d54): DMAR
    <b19>   DW_AT_decl_file   : 4
    <b1a>   DW_AT_decl_line   : 497
    <b1c>   DW_AT_decl_column : 17
    <b1d>   DW_AT_type        : <0x991>
    <b21>   DW_AT_data_member_location: 76
 <2><b22>: Abbrev Number: 4 (DW_TAG_member)
    <b23>   DW_AT_name        : OR
    <b26>   DW_AT_decl_file   : 4
    <b26>   DW_AT_decl_line   : 498
    <b28>   DW_AT_decl_column : 17
    <b28>   DW_AT_type        : <0x991>
    <b2c>   DW_AT_data_member_location: 80
 <2><b2d>: Abbrev Number: 0
 <1><b2e>: Abbrev Number: 7 (DW_TAG_typedef)
    <b2f>   DW_AT_name        : (indirect string, offset: 0x8545a): TIM_TypeDef
    <b33>   DW_AT_decl_file   : 4
    <b34>   DW_AT_decl_line   : 499
    <b36>   DW_AT_decl_column : 2
    <b37>   DW_AT_type        : <0xa14>
 <1><b3b>: Abbrev Number: 5 (DW_TAG_base_type)
    <b3c>   DW_AT_byte_size   : 8
    <b3d>   DW_AT_encoding    : 4	(float)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x886e0): long double
 <1><b42>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <b43>   DW_AT_encoding    : 7	(unsigned)
    <b43>   DW_AT_byte_size   : 1
    <b43>   DW_AT_type        : <0x922>
    <b47>   DW_AT_decl_file   : 5
    <b48>   DW_AT_decl_line   : 39
    <b49>   DW_AT_decl_column : 1
    <b49>   DW_AT_sibling     : <0xb66>
 <2><b4d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x2d04e): HAL_OK
    <b52>   DW_AT_const_value : 0
 <2><b53>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b54>   DW_AT_name        : (indirect string, offset: 0x53893): HAL_ERROR
    <b58>   DW_AT_const_value : 1
 <2><b59>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x1733d): HAL_BUSY
    <b5e>   DW_AT_const_value : 2
 <2><b5f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b60>   DW_AT_name        : (indirect string, offset: 0x2741c): HAL_TIMEOUT
    <b64>   DW_AT_const_value : 3
 <2><b65>: Abbrev Number: 0
 <1><b66>: Abbrev Number: 6 (DW_TAG_typedef)
    <b67>   DW_AT_name        : (indirect string, offset: 0x18fe): HAL_StatusTypeDef
    <b6b>   DW_AT_decl_file   : 5
    <b6c>   DW_AT_decl_line   : 44
    <b6d>   DW_AT_decl_column : 3
    <b6e>   DW_AT_type        : <0xb42>
 <1><b72>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <b73>   DW_AT_encoding    : 7	(unsigned)
    <b73>   DW_AT_byte_size   : 1
    <b73>   DW_AT_type        : <0x922>
    <b77>   DW_AT_decl_file   : 5
    <b78>   DW_AT_decl_line   : 50
    <b79>   DW_AT_decl_column : 1
    <b79>   DW_AT_sibling     : <0xb8a>
 <2><b7d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x62d6e): HAL_UNLOCKED
    <b82>   DW_AT_const_value : 0
 <2><b83>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b84>   DW_AT_name        : (indirect string, offset: 0x84885): HAL_LOCKED
    <b88>   DW_AT_const_value : 1
 <2><b89>: Abbrev Number: 0
 <1><b8a>: Abbrev Number: 6 (DW_TAG_typedef)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x4e83a): HAL_LockTypeDef
    <b8f>   DW_AT_decl_file   : 5
    <b90>   DW_AT_decl_line   : 53
    <b91>   DW_AT_decl_column : 3
    <b92>   DW_AT_type        : <0xb72>
 <1><b96>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b97>   DW_AT_byte_size   : 28
    <b98>   DW_AT_decl_file   : 6
    <b99>   DW_AT_decl_line   : 47
    <b9a>   DW_AT_decl_column : 9
    <b9a>   DW_AT_sibling     : <0xbfa>
 <2><b9e>: Abbrev Number: 2 (DW_TAG_member)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x90c37): Direction
    <ba3>   DW_AT_decl_file   : 6
    <ba4>   DW_AT_decl_line   : 49
    <ba5>   DW_AT_decl_column : 12
    <ba6>   DW_AT_type        : <0x985>
    <baa>   DW_AT_data_member_location: 0
 <2><bab>: Abbrev Number: 2 (DW_TAG_member)
    <bac>   DW_AT_name        : (indirect string, offset: 0x90ce): PeriphInc
    <bb0>   DW_AT_decl_file   : 6
    <bb1>   DW_AT_decl_line   : 53
    <bb2>   DW_AT_decl_column : 12
    <bb3>   DW_AT_type        : <0x985>
    <bb7>   DW_AT_data_member_location: 4
 <2><bb8>: Abbrev Number: 2 (DW_TAG_member)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x14dc7): MemInc
    <bbd>   DW_AT_decl_file   : 6
    <bbe>   DW_AT_decl_line   : 56
    <bbf>   DW_AT_decl_column : 12
    <bc0>   DW_AT_type        : <0x985>
    <bc4>   DW_AT_data_member_location: 8
 <2><bc5>: Abbrev Number: 2 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x4278b): PeriphDataAlignment
    <bca>   DW_AT_decl_file   : 6
    <bcb>   DW_AT_decl_line   : 59
    <bcc>   DW_AT_decl_column : 12
    <bcd>   DW_AT_type        : <0x985>
    <bd1>   DW_AT_data_member_location: 12
 <2><bd2>: Abbrev Number: 2 (DW_TAG_member)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x785b1): MemDataAlignment
    <bd7>   DW_AT_decl_file   : 6
    <bd8>   DW_AT_decl_line   : 62
    <bd9>   DW_AT_decl_column : 12
    <bda>   DW_AT_type        : <0x985>
    <bde>   DW_AT_data_member_location: 16
 <2><bdf>: Abbrev Number: 2 (DW_TAG_member)
    <be0>   DW_AT_name        : (indirect string, offset: 0x917e8): Mode
    <be4>   DW_AT_decl_file   : 6
    <be5>   DW_AT_decl_line   : 65
    <be6>   DW_AT_decl_column : 12
    <be7>   DW_AT_type        : <0x985>
    <beb>   DW_AT_data_member_location: 20
 <2><bec>: Abbrev Number: 2 (DW_TAG_member)
    <bed>   DW_AT_name        : (indirect string, offset: 0x90082): Priority
    <bf1>   DW_AT_decl_file   : 6
    <bf2>   DW_AT_decl_line   : 70
    <bf3>   DW_AT_decl_column : 12
    <bf4>   DW_AT_type        : <0x985>
    <bf8>   DW_AT_data_member_location: 24
 <2><bf9>: Abbrev Number: 0
 <1><bfa>: Abbrev Number: 6 (DW_TAG_typedef)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x23998): DMA_InitTypeDef
    <bff>   DW_AT_decl_file   : 6
    <c00>   DW_AT_decl_line   : 72
    <c01>   DW_AT_decl_column : 3
    <c02>   DW_AT_type        : <0xb96>
 <1><c06>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <c07>   DW_AT_encoding    : 7	(unsigned)
    <c07>   DW_AT_byte_size   : 1
    <c07>   DW_AT_type        : <0x922>
    <c0b>   DW_AT_decl_file   : 6
    <c0c>   DW_AT_decl_line   : 78
    <c0d>   DW_AT_decl_column : 1
    <c0d>   DW_AT_sibling     : <0xc2a>
 <2><c11>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c12>   DW_AT_name        : (indirect string, offset: 0x63d59): HAL_DMA_STATE_RESET
    <c16>   DW_AT_const_value : 0
 <2><c17>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c18>   DW_AT_name        : (indirect string, offset: 0x246ac): HAL_DMA_STATE_READY
    <c1c>   DW_AT_const_value : 1
 <2><c1d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c1e>   DW_AT_name        : (indirect string, offset: 0x5ccf0): HAL_DMA_STATE_BUSY
    <c22>   DW_AT_const_value : 2
 <2><c23>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c24>   DW_AT_name        : (indirect string, offset: 0x82626): HAL_DMA_STATE_TIMEOUT
    <c28>   DW_AT_const_value : 3
 <2><c29>: Abbrev Number: 0
 <1><c2a>: Abbrev Number: 6 (DW_TAG_typedef)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x49905): HAL_DMA_StateTypeDef
    <c2f>   DW_AT_decl_file   : 6
    <c30>   DW_AT_decl_line   : 83
    <c31>   DW_AT_decl_column : 2
    <c32>   DW_AT_type        : <0xc06>
 <1><c36>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <c37>   DW_AT_type        : <0xc2a>
 <1><c3b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x71d36): __DMA_HandleTypeDef
    <c40>   DW_AT_byte_size   : 68
    <c41>   DW_AT_decl_file   : 6
    <c42>   DW_AT_decl_line   : 110
    <c43>   DW_AT_decl_column : 16
    <c44>   DW_AT_sibling     : <0xce5>
 <2><c48>: Abbrev Number: 2 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0x33e9b): Instance
    <c4d>   DW_AT_decl_file   : 6
    <c4e>   DW_AT_decl_line   : 112
    <c4f>   DW_AT_decl_column : 31
    <c50>   DW_AT_type        : <0xce5>
    <c54>   DW_AT_data_member_location: 0
 <2><c55>: Abbrev Number: 2 (DW_TAG_member)
    <c56>   DW_AT_name        : (indirect string, offset: 0x8587f): Init
    <c5a>   DW_AT_decl_file   : 6
    <c5b>   DW_AT_decl_line   : 114
    <c5c>   DW_AT_decl_column : 30
    <c5d>   DW_AT_type        : <0xbfa>
    <c61>   DW_AT_data_member_location: 4
 <2><c62>: Abbrev Number: 2 (DW_TAG_member)
    <c63>   DW_AT_name        : (indirect string, offset: 0x5f61c): Lock
    <c67>   DW_AT_decl_file   : 6
    <c68>   DW_AT_decl_line   : 116
    <c69>   DW_AT_decl_column : 30
    <c6a>   DW_AT_type        : <0xb8a>
    <c6e>   DW_AT_data_member_location: 32
 <2><c6f>: Abbrev Number: 2 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0x8ad0f): State
    <c74>   DW_AT_decl_file   : 6
    <c75>   DW_AT_decl_line   : 118
    <c76>   DW_AT_decl_column : 30
    <c77>   DW_AT_type        : <0xc36>
    <c7b>   DW_AT_data_member_location: 33
 <2><c7c>: Abbrev Number: 2 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x7e3b8): Parent
    <c81>   DW_AT_decl_file   : 6
    <c82>   DW_AT_decl_line   : 120
    <c83>   DW_AT_decl_column : 31
    <c84>   DW_AT_type        : <0xcea>
    <c88>   DW_AT_data_member_location: 36
 <2><c89>: Abbrev Number: 2 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x83eee): XferCpltCallback
    <c8e>   DW_AT_decl_file   : 6
    <c8f>   DW_AT_decl_line   : 122
    <c90>   DW_AT_decl_column : 33
    <c91>   DW_AT_type        : <0xcfc>
    <c95>   DW_AT_data_member_location: 40
 <2><c96>: Abbrev Number: 2 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x67f9a): XferHalfCpltCallback
    <c9b>   DW_AT_decl_file   : 6
    <c9c>   DW_AT_decl_line   : 124
    <c9d>   DW_AT_decl_column : 33
    <c9e>   DW_AT_type        : <0xcfc>
    <ca2>   DW_AT_data_member_location: 44
 <2><ca3>: Abbrev Number: 2 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x13168): XferErrorCallback
    <ca8>   DW_AT_decl_file   : 6
    <ca9>   DW_AT_decl_line   : 126
    <caa>   DW_AT_decl_column : 33
    <cab>   DW_AT_type        : <0xcfc>
    <caf>   DW_AT_data_member_location: 48
 <2><cb0>: Abbrev Number: 2 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x7bfa0): XferAbortCallback
    <cb5>   DW_AT_decl_file   : 6
    <cb6>   DW_AT_decl_line   : 128
    <cb7>   DW_AT_decl_column : 33
    <cb8>   DW_AT_type        : <0xcfc>
    <cbc>   DW_AT_data_member_location: 52
 <2><cbd>: Abbrev Number: 2 (DW_TAG_member)
    <cbe>   DW_AT_name        : (indirect string, offset: 0x819d9): ErrorCode
    <cc2>   DW_AT_decl_file   : 6
    <cc3>   DW_AT_decl_line   : 130
    <cc4>   DW_AT_decl_column : 30
    <cc5>   DW_AT_type        : <0x991>
    <cc9>   DW_AT_data_member_location: 56
 <2><cca>: Abbrev Number: 2 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x392d7): DmaBaseAddress
    <ccf>   DW_AT_decl_file   : 6
    <cd0>   DW_AT_decl_line   : 132
    <cd1>   DW_AT_decl_column : 31
    <cd2>   DW_AT_type        : <0xd01>
    <cd6>   DW_AT_data_member_location: 60
 <2><cd7>: Abbrev Number: 2 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x1b59b): ChannelIndex
    <cdc>   DW_AT_decl_file   : 6
    <cdd>   DW_AT_decl_line   : 134
    <cde>   DW_AT_decl_column : 30
    <cdf>   DW_AT_type        : <0x985>
    <ce3>   DW_AT_data_member_location: 64
 <2><ce4>: Abbrev Number: 0
 <1><ce5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ce6>   DW_AT_byte_size   : 4
    <ce6>   DW_AT_type        : <0x9d6>
 <1><cea>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <ceb>   DW_AT_byte_size   : 4
 <1><cec>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <ced>   DW_AT_prototyped  : 1
    <ced>   DW_AT_sibling     : <0xcf7>
 <2><cf1>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <cf2>   DW_AT_type        : <0xcf7>
 <2><cf6>: Abbrev Number: 0
 <1><cf7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <cf8>   DW_AT_byte_size   : 4
    <cf8>   DW_AT_type        : <0xc3b>
 <1><cfc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <cfd>   DW_AT_byte_size   : 4
    <cfd>   DW_AT_type        : <0xcec>
 <1><d01>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d02>   DW_AT_byte_size   : 4
    <d02>   DW_AT_type        : <0xa07>
 <1><d06>: Abbrev Number: 6 (DW_TAG_typedef)
    <d07>   DW_AT_name        : (indirect string, offset: 0x71d38): DMA_HandleTypeDef
    <d0b>   DW_AT_decl_file   : 6
    <d0c>   DW_AT_decl_line   : 136
    <d0d>   DW_AT_decl_column : 3
    <d0e>   DW_AT_type        : <0xc3b>
 <1><d12>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d13>   DW_AT_byte_size   : 4
    <d13>   DW_AT_type        : <0xd06>
 <1><d17>: Abbrev Number: 14 (DW_TAG_structure_type)
    <d18>   DW_AT_byte_size   : 24
    <d19>   DW_AT_decl_file   : 7
    <d1a>   DW_AT_decl_line   : 46
    <d1b>   DW_AT_decl_column : 9
    <d1b>   DW_AT_sibling     : <0xd6e>
 <2><d1f>: Abbrev Number: 2 (DW_TAG_member)
    <d20>   DW_AT_name        : (indirect string, offset: 0x8dacb): Prescaler
    <d24>   DW_AT_decl_file   : 7
    <d25>   DW_AT_decl_line   : 48
    <d26>   DW_AT_decl_column : 12
    <d27>   DW_AT_type        : <0x985>
    <d2b>   DW_AT_data_member_location: 0
 <2><d2c>: Abbrev Number: 2 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x85680): CounterMode
    <d31>   DW_AT_decl_file   : 7
    <d32>   DW_AT_decl_line   : 51
    <d33>   DW_AT_decl_column : 12
    <d34>   DW_AT_type        : <0x985>
    <d38>   DW_AT_data_member_location: 4
 <2><d39>: Abbrev Number: 2 (DW_TAG_member)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x9852d): Period
    <d3e>   DW_AT_decl_file   : 7
    <d3f>   DW_AT_decl_line   : 54
    <d40>   DW_AT_decl_column : 12
    <d41>   DW_AT_type        : <0x985>
    <d45>   DW_AT_data_member_location: 8
 <2><d46>: Abbrev Number: 2 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0x854cc): ClockDivision
    <d4b>   DW_AT_decl_file   : 7
    <d4c>   DW_AT_decl_line   : 58
    <d4d>   DW_AT_decl_column : 12
    <d4e>   DW_AT_type        : <0x985>
    <d52>   DW_AT_data_member_location: 12
 <2><d53>: Abbrev Number: 2 (DW_TAG_member)
    <d54>   DW_AT_name        : (indirect string, offset: 0x85603): RepetitionCounter
    <d58>   DW_AT_decl_file   : 7
    <d59>   DW_AT_decl_line   : 61
    <d5a>   DW_AT_decl_column : 12
    <d5b>   DW_AT_type        : <0x985>
    <d5f>   DW_AT_data_member_location: 16
 <2><d60>: Abbrev Number: 2 (DW_TAG_member)
    <d61>   DW_AT_name        : (indirect string, offset: 0x853f9): AutoReloadPreload
    <d65>   DW_AT_decl_file   : 7
    <d66>   DW_AT_decl_line   : 72
    <d67>   DW_AT_decl_column : 12
    <d68>   DW_AT_type        : <0x985>
    <d6c>   DW_AT_data_member_location: 20
 <2><d6d>: Abbrev Number: 0
 <1><d6e>: Abbrev Number: 6 (DW_TAG_typedef)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x8566b): TIM_Base_InitTypeDef
    <d73>   DW_AT_decl_file   : 7
    <d74>   DW_AT_decl_line   : 74
    <d75>   DW_AT_decl_column : 3
    <d76>   DW_AT_type        : <0xd17>
 <1><d7a>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <d7b>   DW_AT_encoding    : 7	(unsigned)
    <d7b>   DW_AT_byte_size   : 1
    <d7b>   DW_AT_type        : <0x922>
    <d7f>   DW_AT_decl_file   : 7
    <d7f>   DW_AT_decl_line   : 291
    <d81>   DW_AT_decl_column : 1
    <d81>   DW_AT_sibling     : <0xda4>
 <2><d85>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d86>   DW_AT_name        : (indirect string, offset: 0x85527): HAL_TIM_STATE_RESET
    <d8a>   DW_AT_const_value : 0
 <2><d8b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x853e5): HAL_TIM_STATE_READY
    <d90>   DW_AT_const_value : 1
 <2><d91>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d92>   DW_AT_name        : (indirect string, offset: 0x85466): HAL_TIM_STATE_BUSY
    <d96>   DW_AT_const_value : 2
 <2><d97>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d98>   DW_AT_name        : (indirect string, offset: 0x85655): HAL_TIM_STATE_TIMEOUT
    <d9c>   DW_AT_const_value : 3
 <2><d9d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x854a7): HAL_TIM_STATE_ERROR
    <da2>   DW_AT_const_value : 4
 <2><da3>: Abbrev Number: 0
 <1><da4>: Abbrev Number: 7 (DW_TAG_typedef)
    <da5>   DW_AT_name        : (indirect string, offset: 0x85615): HAL_TIM_StateTypeDef
    <da9>   DW_AT_decl_file   : 7
    <daa>   DW_AT_decl_line   : 297
    <dac>   DW_AT_decl_column : 3
    <dad>   DW_AT_type        : <0xd7a>
 <1><db1>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <db2>   DW_AT_type        : <0xda4>
 <1><db6>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <db7>   DW_AT_encoding    : 7	(unsigned)
    <db7>   DW_AT_byte_size   : 1
    <db7>   DW_AT_type        : <0x922>
    <dbb>   DW_AT_decl_file   : 7
    <dbb>   DW_AT_decl_line   : 303
    <dbd>   DW_AT_decl_column : 1
    <dbd>   DW_AT_sibling     : <0xdd4>
 <2><dc1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x8548b): HAL_TIM_CHANNEL_STATE_RESET
    <dc6>   DW_AT_const_value : 0
 <2><dc7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x855d3): HAL_TIM_CHANNEL_STATE_READY
    <dcc>   DW_AT_const_value : 1
 <2><dcd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dce>   DW_AT_name        : (indirect string, offset: 0x8550c): HAL_TIM_CHANNEL_STATE_BUSY
    <dd2>   DW_AT_const_value : 2
 <2><dd3>: Abbrev Number: 0
 <1><dd4>: Abbrev Number: 7 (DW_TAG_typedef)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x8543e): HAL_TIM_ChannelStateTypeDef
    <dd9>   DW_AT_decl_file   : 7
    <dda>   DW_AT_decl_line   : 307
    <ddc>   DW_AT_decl_column : 3
    <ddd>   DW_AT_type        : <0xdb6>
 <1><de1>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <de2>   DW_AT_type        : <0xdd4>
 <1><de6>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <de7>   DW_AT_encoding    : 7	(unsigned)
    <de7>   DW_AT_byte_size   : 1
    <de7>   DW_AT_type        : <0x922>
    <deb>   DW_AT_decl_file   : 7
    <deb>   DW_AT_decl_line   : 313
    <ded>   DW_AT_decl_column : 1
    <ded>   DW_AT_sibling     : <0xe04>
 <2><df1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df2>   DW_AT_name        : (indirect string, offset: 0x853cb): HAL_DMA_BURST_STATE_RESET
    <df6>   DW_AT_const_value : 0
 <2><df7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df8>   DW_AT_name        : (indirect string, offset: 0x85555): HAL_DMA_BURST_STATE_READY
    <dfc>   DW_AT_const_value : 1
 <2><dfd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x8562a): HAL_DMA_BURST_STATE_BUSY
    <e02>   DW_AT_const_value : 2
 <2><e03>: Abbrev Number: 0
 <1><e04>: Abbrev Number: 7 (DW_TAG_typedef)
    <e05>   DW_AT_name        : (indirect string, offset: 0x8540b): HAL_TIM_DMABurstStateTypeDef
    <e09>   DW_AT_decl_file   : 7
    <e0a>   DW_AT_decl_line   : 317
    <e0c>   DW_AT_decl_column : 3
    <e0d>   DW_AT_type        : <0xde6>
 <1><e11>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e12>   DW_AT_type        : <0xe04>
 <1><e16>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <e17>   DW_AT_encoding    : 7	(unsigned)
    <e17>   DW_AT_byte_size   : 1
    <e17>   DW_AT_type        : <0x922>
    <e1b>   DW_AT_decl_file   : 7
    <e1b>   DW_AT_decl_line   : 323
    <e1d>   DW_AT_decl_column : 1
    <e1d>   DW_AT_sibling     : <0xe40>
 <2><e21>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e22>   DW_AT_name        : (indirect string, offset: 0x8556f): HAL_TIM_ACTIVE_CHANNEL_1
    <e26>   DW_AT_const_value : 1
 <2><e27>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e28>   DW_AT_name        : (indirect string, offset: 0x85588): HAL_TIM_ACTIVE_CHANNEL_2
    <e2c>   DW_AT_const_value : 2
 <2><e2d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x855a1): HAL_TIM_ACTIVE_CHANNEL_3
    <e32>   DW_AT_const_value : 4
 <2><e33>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e34>   DW_AT_name        : (indirect string, offset: 0x855ba): HAL_TIM_ACTIVE_CHANNEL_4
    <e38>   DW_AT_const_value : 8
 <2><e39>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x854da): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <e3e>   DW_AT_const_value : 0
 <2><e3f>: Abbrev Number: 0
 <1><e40>: Abbrev Number: 7 (DW_TAG_typedef)
    <e41>   DW_AT_name        : (indirect string, offset: 0x85428): HAL_TIM_ActiveChannel
    <e45>   DW_AT_decl_file   : 7
    <e46>   DW_AT_decl_line   : 329
    <e48>   DW_AT_decl_column : 3
    <e49>   DW_AT_type        : <0xe16>
 <1><e4d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e4e>   DW_AT_byte_size   : 72
    <e4f>   DW_AT_decl_file   : 7
    <e50>   DW_AT_decl_line   : 337
    <e52>   DW_AT_decl_column : 9
    <e52>   DW_AT_sibling     : <0xed5>
 <2><e56>: Abbrev Number: 3 (DW_TAG_member)
    <e57>   DW_AT_name        : (indirect string, offset: 0x33e9b): Instance
    <e5b>   DW_AT_decl_file   : 7
    <e5c>   DW_AT_decl_line   : 340
    <e5e>   DW_AT_decl_column : 39
    <e5f>   DW_AT_type        : <0xed5>
    <e63>   DW_AT_data_member_location: 0
 <2><e64>: Abbrev Number: 3 (DW_TAG_member)
    <e65>   DW_AT_name        : (indirect string, offset: 0x8587f): Init
    <e69>   DW_AT_decl_file   : 7
    <e6a>   DW_AT_decl_line   : 341
    <e6c>   DW_AT_decl_column : 38
    <e6d>   DW_AT_type        : <0xd6e>
    <e71>   DW_AT_data_member_location: 4
 <2><e72>: Abbrev Number: 3 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x85436): Channel
    <e77>   DW_AT_decl_file   : 7
    <e78>   DW_AT_decl_line   : 342
    <e7a>   DW_AT_decl_column : 38
    <e7b>   DW_AT_type        : <0xe40>
    <e7f>   DW_AT_data_member_location: 28
 <2><e80>: Abbrev Number: 3 (DW_TAG_member)
    <e81>   DW_AT_name        : (indirect string, offset: 0x855ef): hdma
    <e85>   DW_AT_decl_file   : 7
    <e86>   DW_AT_decl_line   : 343
    <e88>   DW_AT_decl_column : 39
    <e89>   DW_AT_type        : <0xeda>
    <e8d>   DW_AT_data_member_location: 32
 <2><e8e>: Abbrev Number: 3 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x5f61c): Lock
    <e93>   DW_AT_decl_file   : 7
    <e94>   DW_AT_decl_line   : 345
    <e96>   DW_AT_decl_column : 38
    <e97>   DW_AT_type        : <0xb8a>
    <e9b>   DW_AT_data_member_location: 60
 <2><e9c>: Abbrev Number: 3 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x8ad0f): State
    <ea1>   DW_AT_decl_file   : 7
    <ea2>   DW_AT_decl_line   : 346
    <ea4>   DW_AT_decl_column : 38
    <ea5>   DW_AT_type        : <0xdb1>
    <ea9>   DW_AT_data_member_location: 61
 <2><eaa>: Abbrev Number: 3 (DW_TAG_member)
    <eab>   DW_AT_name        : (indirect string, offset: 0x91e2c): ChannelState
    <eaf>   DW_AT_decl_file   : 7
    <eb0>   DW_AT_decl_line   : 347
    <eb2>   DW_AT_decl_column : 38
    <eb3>   DW_AT_type        : <0xefa>
    <eb7>   DW_AT_data_member_location: 62
 <2><eb8>: Abbrev Number: 3 (DW_TAG_member)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x923bf): ChannelNState
    <ebd>   DW_AT_decl_file   : 7
    <ebe>   DW_AT_decl_line   : 348
    <ec0>   DW_AT_decl_column : 38
    <ec1>   DW_AT_type        : <0xefa>
    <ec5>   DW_AT_data_member_location: 66
 <2><ec6>: Abbrev Number: 3 (DW_TAG_member)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x919b8): DMABurstState
    <ecb>   DW_AT_decl_file   : 7
    <ecc>   DW_AT_decl_line   : 349
    <ece>   DW_AT_decl_column : 38
    <ecf>   DW_AT_type        : <0xe11>
    <ed3>   DW_AT_data_member_location: 70
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ed6>   DW_AT_byte_size   : 4
    <ed6>   DW_AT_type        : <0xb2e>
 <1><eda>: Abbrev Number: 16 (DW_TAG_array_type)
    <edb>   DW_AT_type        : <0xd12>
    <edf>   DW_AT_sibling     : <0xeea>
 <2><ee3>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ee4>   DW_AT_type        : <0x972>
    <ee8>   DW_AT_upper_bound : 6
 <2><ee9>: Abbrev Number: 0
 <1><eea>: Abbrev Number: 16 (DW_TAG_array_type)
    <eeb>   DW_AT_type        : <0xde1>
    <eef>   DW_AT_sibling     : <0xefa>
 <2><ef3>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ef4>   DW_AT_type        : <0x972>
    <ef8>   DW_AT_upper_bound : 3
 <2><ef9>: Abbrev Number: 0
 <1><efa>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <efb>   DW_AT_type        : <0xeea>
 <1><eff>: Abbrev Number: 7 (DW_TAG_typedef)
    <f00>   DW_AT_name        : (indirect string, offset: 0x85479): TIM_HandleTypeDef
    <f04>   DW_AT_decl_file   : 7
    <f05>   DW_AT_decl_line   : 380
    <f07>   DW_AT_decl_column : 3
    <f08>   DW_AT_type        : <0xe4d>
 <1><f0c>: Abbrev Number: 24 (DW_TAG_subprogram)
    <f0d>   DW_AT_external    : 1
    <f0d>   DW_AT_name        : (indirect string, offset: 0x854f9): HAL_TIM_Base_Start
    <f11>   DW_AT_decl_file   : 7
    <f12>   DW_AT_decl_line   : 1895
    <f14>   DW_AT_decl_column : 19
    <f15>   DW_AT_prototyped  : 1
    <f15>   DW_AT_type        : <0xb66>
    <f19>   DW_AT_declaration : 1
    <f19>   DW_AT_sibling     : <0xf23>
 <2><f1d>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <f1e>   DW_AT_type        : <0xf23>
 <2><f22>: Abbrev Number: 0
 <1><f23>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f24>   DW_AT_byte_size   : 4
    <f24>   DW_AT_type        : <0xeff>
 <1><f28>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f29>   DW_AT_external    : 1
    <f29>   DW_AT_name        : (indirect string, offset: 0x8568c): DELAY_TIM_Ms
    <f2d>   DW_AT_decl_file   : 1
    <f2d>   DW_AT_decl_line   : 22
    <f2e>   DW_AT_decl_column : 6
    <f2e>   DW_AT_prototyped  : 1
    <f2e>   DW_AT_low_pc      : 0
    <f32>   DW_AT_high_pc     : 0x3a
    <f36>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f38>   DW_AT_call_all_calls: 1
    <f38>   DW_AT_sibling     : <0xf59>
 <2><f3c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x85650): htim
    <f41>   DW_AT_decl_file   : 1
    <f41>   DW_AT_decl_line   : 22
    <f42>   DW_AT_decl_column : 38
    <f43>   DW_AT_type        : <0xf23>
    <f47>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f4a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x921ad): Time
    <f4f>   DW_AT_decl_file   : 1
    <f4f>   DW_AT_decl_line   : 22
    <f50>   DW_AT_decl_column : 53
    <f51>   DW_AT_type        : <0x979>
    <f55>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><f58>: Abbrev Number: 0
 <1><f59>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f5a>   DW_AT_external    : 1
    <f5a>   DW_AT_name        : (indirect string, offset: 0x85643): DELAY_TIM_Us
    <f5e>   DW_AT_decl_file   : 1
    <f5e>   DW_AT_decl_line   : 17
    <f5f>   DW_AT_decl_column : 6
    <f5f>   DW_AT_prototyped  : 1
    <f5f>   DW_AT_low_pc      : 0x80010e2
    <f63>   DW_AT_high_pc     : 0x2e
    <f67>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f69>   DW_AT_call_all_calls: 1
    <f69>   DW_AT_sibling     : <0xf8a>
 <2><f6d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x85650): htim
    <f72>   DW_AT_decl_file   : 1
    <f72>   DW_AT_decl_line   : 17
    <f73>   DW_AT_decl_column : 38
    <f74>   DW_AT_type        : <0xf23>
    <f78>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f7b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x8ceeb): time
    <f80>   DW_AT_decl_file   : 1
    <f80>   DW_AT_decl_line   : 17
    <f81>   DW_AT_decl_column : 53
    <f82>   DW_AT_type        : <0x979>
    <f86>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><f89>: Abbrev Number: 0
 <1><f8a>: Abbrev Number: 25 (DW_TAG_subprogram)
    <f8b>   DW_AT_external    : 1
    <f8b>   DW_AT_name        : (indirect string, offset: 0x855f4): DELAY_TIM_Init
    <f8f>   DW_AT_decl_file   : 1
    <f90>   DW_AT_decl_line   : 12
    <f91>   DW_AT_decl_column : 6
    <f92>   DW_AT_prototyped  : 1
    <f92>   DW_AT_low_pc      : 0x80010cc
    <f96>   DW_AT_high_pc     : 0x16
    <f9a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f9c>   DW_AT_call_all_tail_calls: 1
 <2><f9c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x85650): htim
    <fa1>   DW_AT_decl_file   : 1
    <fa1>   DW_AT_decl_line   : 12
    <fa2>   DW_AT_decl_column : 40
    <fa3>   DW_AT_type        : <0xf23>
    <fa7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><faa>: Abbrev Number: 0
 <1><fab>: Abbrev Number: 0
  Compilation Unit @ offset 0xfac:
   Length:        0xa4f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x34d
   Pointer Size:  4
 <0><fb8>: Abbrev Number: 25 (DW_TAG_compile_unit)
    <fb9>   DW_AT_producer    : (indirect string, offset: 0x1a9b8): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <fbd>   DW_AT_language    : 29	(C11)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x856e7): ../Core/Src/dht11.c
    <fc2>   DW_AT_comp_dir    : (indirect string, offset: 0x125aa): C:/Users/tanla/STM32CubeIDE/workspace_1.15.1/TKHTN/Debug
    <fc6>   DW_AT_ranges      : 0x83
    <fca>   DW_AT_low_pc      : 0
    <fce>   DW_AT_stmt_list   : 0x104e
    <fd2>   DW_AT_macros      : 0x15e98
 <1><fd6>: Abbrev Number: 6 (DW_TAG_base_type)
    <fd7>   DW_AT_byte_size   : 1
    <fd8>   DW_AT_encoding    : 6	(signed char)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x42eae): signed char
 <1><fdd>: Abbrev Number: 5 (DW_TAG_typedef)
    <fde>   DW_AT_name        : (indirect string, offset: 0x26f9d): __uint8_t
    <fe2>   DW_AT_decl_file   : 2
    <fe3>   DW_AT_decl_line   : 43
    <fe4>   DW_AT_decl_column : 24
    <fe5>   DW_AT_type        : <0xfe9>
 <1><fe9>: Abbrev Number: 6 (DW_TAG_base_type)
    <fea>   DW_AT_byte_size   : 1
    <feb>   DW_AT_encoding    : 8	(unsigned char)
    <fec>   DW_AT_name        : (indirect string, offset: 0x1af4b): unsigned char
 <1><ff0>: Abbrev Number: 6 (DW_TAG_base_type)
    <ff1>   DW_AT_byte_size   : 2
    <ff2>   DW_AT_encoding    : 5	(signed)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x63a9f): short int
 <1><ff7>: Abbrev Number: 5 (DW_TAG_typedef)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x6d592): __uint16_t
    <ffc>   DW_AT_decl_file   : 2
    <ffd>   DW_AT_decl_line   : 57
    <ffe>   DW_AT_decl_column : 25
    <fff>   DW_AT_type        : <0x1003>
 <1><1003>: Abbrev Number: 6 (DW_TAG_base_type)
    <1004>   DW_AT_byte_size   : 2
    <1005>   DW_AT_encoding    : 7	(unsigned)
    <1006>   DW_AT_name        : (indirect string, offset: 0x2b9b0): short unsigned int
 <1><100a>: Abbrev Number: 6 (DW_TAG_base_type)
    <100b>   DW_AT_byte_size   : 4
    <100c>   DW_AT_encoding    : 5	(signed)
    <100d>   DW_AT_name        : (indirect string, offset: 0xb9ac): long int
 <1><1011>: Abbrev Number: 5 (DW_TAG_typedef)
    <1012>   DW_AT_name        : (indirect string, offset: 0x5501d): __uint32_t
    <1016>   DW_AT_decl_file   : 2
